#Область ОбработчикиСобытийФормы

&НаКлиенте
Перем Криптография, РаботаСДвоичнымиДанными, СтраницыТекущаяСтраница, СтраницыПрогрессаТекущаяСтраница;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	ЭтоПодчиненныйУзелРИБ = ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ();
	
	ЗаполнитьЗаголовкиРеквизитов();
	
	ПриИзмененииВидаДокументаНаСервере();
	
	Если ЗначениеЗаполнено(Параметры.СертификатСсылка) Тогда
		ЗагрузитьЗаявление();
	Иначе
		УстановитьСоглашение();
		Объект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.НеПодготовлено;
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Организация = Параметры.Организация;
			Элементы.Организация.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокПрограмм();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// При изменении состава или настроек программ.
	Если ВРег(ИмяСобытия) = ВРег("Запись_ПрограммыЭлектроннойПодписиИШифрования")
	 Или ВРег(ИмяСобытия) = ВРег("Запись_ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux") Тогда
		
		ПодключитьОбработчикОжидания("ПриИзмененияСоставаИлиНастроекПрограмм", 0.1, Истина);
	КонецЕсли;
	
	Если Лев(ИмяСобытия, СтрДлина("Запись_")) <> "Запись_" Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = Организация Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияРеквизитыОрганизацииПриИзменении", 0.1, Истина);
	КонецЕсли;
	
	Если Источник = Директор
	 Или Источник = ГлавныйБухгалтер
	 Или Источник = Сотрудник Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВладелецСертификата Тогда
			ПодключитьОбработчикОжидания("ОбработчикОжиданияРеквизитыВладельцаПриИзменении", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Источник = ДокументыПартнерСсылка
	   И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтправкаЗаявления Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикОжиданияРеквизитыПартнераПриИзменении", 0.1, Истина);
	КонецЕсли;
	
	Если Источник = ДокументыРуководительСсылка
	   И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтправкаЗаявления Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикОжиданияРеквизитыРуководителяПриИзменении", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
#Если ВебКлиент Тогда
	ПодключитьОбработчикОжидания("ОбновитьТекущиеСтраницы", 0.1, Истина);
	
	СтраницыТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	СтраницыПрогрессаТекущаяСтраница = Элементы.СтраницыПрогресса.ТекущаяСтраница;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСоглашение;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаСоглашение;
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущиеСтраницы()
	
	Элементы.Страницы.ТекущаяСтраница = СтраницыТекущаяСтраница;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = СтраницыПрогрессаТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если Объект.СостояниеЗаявления = ПредопределенноеЗначение("Перечисление.СостоянияЗаявленияНаВыпускСертификата.Подготовлено")
	 Или Объект.СостояниеЗаявления = ПредопределенноеЗначение("Перечисление.СостоянияЗаявленияНаВыпускСертификата.НеПодготовлено")
	   И Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодготовкаЗапросаНаСертификат Тогда
		
		ЗаписатьИРазблокироватьОбъект();
		ПослеЗаписи();
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РазблокироватьОбъект(Объект.Ссылка, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДекорацияУдостоверяющийЦентрНаименованиеНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("http://ca.1c.ru/");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеСоглашенияПриИзменении(Элемент)
	
	Элементы.ФормаДалее.Доступность = ПодтверждениеСоглашения;
	
КонецПроцедуры

// Реквизиты организации.

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОчиститьРеквизитыОрганизации();
	ПриИзмененииОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьРеквизитыОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическийАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПредставлениеАдресаНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка,
		"ЮридическийАдрес", НСтр("ru = 'Юридический адрес организации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическийАдресОчистка(Элемент, СтандартнаяОбработка)
	
	ПредставлениеАдресаОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка, "ЮридическийАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическийАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПредставлениеАдресаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, "ЮридическийАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПредставлениеАдресаНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка,
		"ФактическийАдрес", НСтр("ru = 'Фактический адрес организации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресОчистка(Элемент, СтандартнаяОбработка)
	
	ПредставлениеАдресаОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка, "ФактическийАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийАдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	 ПредставлениеАдресаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, "ФактическийАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПредупреждениеНажатие(Элемент)
	
	ПоказатьПредупреждение(, Элемент.Подсказка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПредставлениеТелефонаНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка,
		"Телефон", НСтр("ru = 'Телефон организации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонОчистка(Элемент, СтандартнаяОбработка)
	
	ПредставлениеТелефонаОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка, "Телефон");
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	 ПредставлениеТелефонаОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, "Телефон");
	
КонецПроцедуры

// Реквизиты сотрудника (должностного лица организации).

&НаКлиенте
Процедура ВидВладельцаПриИзменении(Элемент)
	
	ОчиститьРеквизитыВладельца();
	ПриИзмененииВладельцаСертификатаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОчистка(Элемент, СтандартнаяОбработка)
	
	Если СотрудникТип <> Неопределено
	   И СотрудникТип.Количество() = 1
	   И Сотрудник = Неопределено Тогда
		
		ОписаниеТипов = Новый ОписаниеТипов(СотрудникТип.ВыгрузитьЗначения());
		Сотрудник = ОписаниеТипов.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Если ВидВладельца = "Сотрудник" Тогда
		ОчиститьРеквизитыВладельца();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Сотрудник = ВыбранноеЗначение;
	
	ПриИзмененииВладельцаСертификатаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховойНомерПФРПриИзменении(Элемент)
	
	СтраховойНомерПФР = ТолькоЦифры(СтраховойНомерПФР);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументВидПриИзменении(Элемент)
	
	ПриИзмененииВидаДокументаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументВидОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНомерПриИзменении(Элемент)
	
	ДокументНомер = ТолькоЦифры(ДокументНомер);
	
КонецПроцедуры

// Реквизиты создания ключа.

&НаКлиенте
Процедура ПрограммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для каждого Строка Из СписокПрограмм Цикл
		Значение = ?(ЗначениеЗаполнено(Строка.Ссылка), Строка.Ссылка, Строка.Идентификатор);
		ДанныеВыбора.Добавить(Значение, Строка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Представление = ПоставляемоеПредставлениеПрограммы(СписокПрограмм, ВыбранноеЗначение);
		
		Если Не ЭтоПолноправныйПользователь Тогда
			ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Программа %1 еще не добавлена в список используемых программ.
					           |Обратитесь к администратору.'"),
					Представление));
			
		ИначеЕсли ЭтоПодчиненныйУзелРИБ Тогда
			ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Программа %1 еще не добавлена в список используемых программ.
					           |Выполните добавление в главном узле информационной базы.'"),
					Представление));
		Иначе
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Добавить",    НСтр("ru = 'Добавить'"));
			Кнопки.Добавить("НеДобавлять", НСтр("ru = 'Не добавлять'"));
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ПрограммаОбработкаВыбораПродолжение", ЭтотОбъект, ВыбранноеЗначение),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Программа %1 еще не добавлена в список используемых программ.
					           |Добавить?'"),
					Представление),
				Кнопки,, "НеДобавлять");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Объект.Программа = ВыбранноеЗначение;
	
	ПослеВыбораПрограммы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСозданиеКлючаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылка = "КлючЭлектроннойПодписи" Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Ключ электронной подписи - это секретная информация, которая сохраняется
			           |на компьютер, флешку, дискету или другой носитель информации и
			           |используется в дальнейшем для создания электронных подписей.'"));
		
	ИначеЕсли НавигационнаяСсылка = "ЗапросНаСертификат" Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Запрос на сертификат - это не секретная информация, которая создается
			           |на основе ключа электронной подписи, отправляется вместе с заявлением
			           |на выпуск сертификата и требуется для выпуска сертификата.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПояснениеПрограммыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭлектроннаяПодписьСлужебныйКлиент.ОткрытьИнструкциюПоРаботеСПрограммами();
	
КонецПроцедуры

// Реквизиты отправки заявления.

&НаКлиенте
Процедура ДокументыРуководительПриИзменении(Элемент)
	
	ДокументыРуководительСсылка = Неопределено;
	Элементы.ДокументыРуководитель.КнопкаОткрытия = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРуководительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРуководительОчистка(Элемент, СтандартнаяОбработка)
	
	ДокументыРуководительСсылка = Неопределено;
	Элементы.ДокументыРуководитель.КнопкаОткрытия = Неопределено;
	ОчиститьРеквизит("ДокументыРуководительДолжность");
	ОчиститьРеквизит("ДокументыРуководительОснование");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРуководительОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗначениеОткрытие(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРуководительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ПриИзмененииРуководителяНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылка <> "КомплектДокументов" Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		ТекстПредупреждения =
			НСтр("ru = 'Комплект документов:
			           |1. Заявление на выпуск сертификата (подготовленное на предыдущем шаге).
			           |2. Копия свидетельства о постановке на учет в налоговом органе (ИНН).
			           |3. Копия свидетельства о государственной регистрации индивидуального предпринимателя (ОГРН).
			           |4. Копия документа, удостоверяющего личность владельца сертификата.
			           |5. Копия страхового свидетельства обязательного пенсионного страхования (СНИЛС) владельца сертификата.'");
	Иначе
		ТекстПредупреждения =
			НСтр("ru = 'Комплект документов:
			           |1. Заявление на выпуск сертификата (подготовленное на предыдущем шаге).
			           |2. Копия* свидетельства о постановке на учет в налоговом органе (ИНН).
			           |3. Копия* свидетельства о государственной регистрации юридического лица (ОГРН).
			           |4. Копия* документа, удостоверяющего личность представителя организации, указанного для выпуска сертификата.
			           |5. Копия* страхового свидетельства обязательного пенсионного страхования (СНИЛС) представителя организации,
			           |   указанного для выпуска сертификата.
			           |6. Копия* документа, подтверждающего полномочия руководителя, подписавшего заявление (протокол собрания
			           |   учредителей, решение собственника, устав) или актуальная выписка из ЕГРЮЛ, заверенная налоговым органом.
			           |
			           |* Копии документов заверяются подписью руководителя и печатью организации.'");
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПартнерПриИзменении(Элемент)
	
	ДокументыПартнерСсылка = Неопределено;
	Элементы.ДокументыПартнер.КнопкаОткрытия = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПартнерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПартнерОчистка(Элемент, СтандартнаяОбработка)
	
	ДокументыПартнерСсылка = Неопределено;
	Элементы.ДокументыПартнер.КнопкаОткрытия = Неопределено;
	
	ОчиститьРеквизитыПартнера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПартнерОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗначениеОткрытие(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПартнерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
	ПриИзмененииПартнераНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСоглашение Тогда
		ПерейтиНаСтраницуОрганизация();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОрганизация Тогда
		ПерейтиНаСтраницуВладелецСертификата();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВладелецСертификата Тогда
		ПерейтиНаСтраницуПодготовкаЗапросаНаСертификат();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодготовкаЗапросаНаСертификат Тогда
		ПерейтиНаСтраницуОтправкаЗаявления();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтправкаЗаявления Тогда
		ПерейтиНаСтраницуОжиданиеОбработкиЗаявления();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОжиданиеОбработкиЗаявления Тогда
		ПерейтиНаСтраницуУстановкаСертификата();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУстановкаСертификата Тогда
		ЗакрытьПомощникПослеУстановкиСертификата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОрганизация Тогда
		ПерейтиНаСтраницуСоглашение();
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСоглашение;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВладелецСертификата Тогда
		ПерейтиНаСтраницуОрганизация(Истина);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодготовкаЗапросаНаСертификат Тогда
		ПерейтиНаСтраницуВладелецСертификата(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗапросНаСертификат(Команда)
	
	ЭлектроннаяПодписьКлиент.СохранитьЗапросНаСертификат(АдресЗапросаНаСертификат, ИмяФайлаБезРасширения());
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьДокументы(Команда)
	
	Документ = ПодготовленныйДокумент();
	
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПечатнойФормы = "ЗаявлениеНаВыпускСертификат";
	НазваниеПечатнойФормы = НСтр("ru = 'Заявление на выпуск сертификата'");
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		Документ.Показать(НазваниеПечатнойФормы);
		ДокументыПечатались = Истина;
		Возврат;
	КонецЕсли;
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент = Документ;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
	ДокументыПечатались = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСертификат(Команда)
	
	ЭлектроннаяПодписьКлиент.СохранитьСертификат(АдресСертификата, ИмяФайлаБезРасширения());
	ЭлектроннаяПодписьКлиент.СохранитьСертификат(АдресКорневогоСертификата,
		НСтр("ru = 'Корневой сертификат ООО НПЦ 1С'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ИмяФайлаБезРасширения()
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		ИмяФайлаБезРасширения = Фамилия + " " + Имя + " " + Отчество;
	Иначе
		ИмяФайлаБезРасширения = Фамилия + " " + Имя + " " + Отчество + ", " + НаименованиеСокращенное
			+ ?(ЗначениеЗаполнено(Подразделение), ", " + Подразделение, "") + ", " + Должность;
	КонецЕсли;
	
	Возврат ИмяФайлаБезРасширения;
	
КонецФункции

&НаСервере
Процедура ПерейтиНаСтраницуСоглашение()
	
	Элементы.ФормаНазад.Видимость = Ложь;
	Элементы.ФормаНапечататьСоглашение.Видимость = Истина;
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Отмена'");
	
	УстановитьСоглашение();
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаСтраницуОрганизация(Назад = Ложь)
	
	ПриИзмененииОрганизацииНаСервере(Назад);
	
	Элементы.ФормаНазад.Видимость = Истина;
	Элементы.ФормаНапечататьСоглашение.Видимость = Ложь;
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Отмена'");
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОрганизация;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаОрганизация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуВладелецСертификата(Назад = Ложь)
	
	ПерейтиНаСтраницуВладелецСертификатаНаСервере(Назад);
	
	Если СотрудникТип <> Неопределено
	   И СотрудникТип.Количество() = 1
	   И Сотрудник = Неопределено Тогда
		
		ОписаниеТипов = Новый ОписаниеТипов(СотрудникТип.ВыгрузитьЗначения());
		Сотрудник = ОписаниеТипов.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаСтраницуВладелецСертификатаНаСервере(Назад = Ложь)
	
	Если Не Назад И Не ОрганизацияЗаполнена() Тогда
		Возврат;
	КонецЕсли;
	
	Если Назад Тогда
		ЗаписатьЗаявление();
	КонецЕсли;
	
	ПриИзмененииВладельцаСертификатаНаСервере(Назад);
	
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Отмена'");
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВладелецСертификата;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаВладелецСертификата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуПодготовкаЗапросаНаСертификат()
	
	ЗаполнитьПрограмму();
	
	Если ПерейтиНаСтраницуПодготовкаЗапросаНаСертификатНаСервере() Тогда
		ПослеЗаписи();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПерейтиНаСтраницуПодготовкаЗапросаНаСертификатНаСервере()
	
	Если Не ВладелецЗаполнен() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Объект.Добавил = Пользователи.ТекущийПользователь();
	Если Не ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Объект.Пользователь = Объект.Добавил;
	КонецЕсли;
	
	ЗаписатьЗаявление(); // После записи заявление будет открываться с этой страницы.
	
	ПерейтиНаСтраницуПодготовкаЗапросаНаСертификатНаСервереПриЗагрузке();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПерейтиНаСтраницуПодготовкаЗапросаНаСертификатНаСервереПриЗагрузке()
	
	Элементы.ФормаНазад.Видимость = Истина;
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
	
	ЗаполнитьРеквизитыЗаявления();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		
		ФактическийАдресСтруктура =
			МодульУправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(ФактическийАдресXML);
		
		ЮридическийАдресСтруктура =
			МодульУправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(ЮридическийАдресXML);
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодготовкаЗапросаНаСертификат;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаПодготовкаЗапросаНаСертификат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОтправкаЗаявления()
	
	Если Не ЗначениеЗаполнено(Объект.Программа) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Поле ""Программа электронной подписи"" не заполнено'")), , "Программа");
		
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = Новый Структура;
	Менеджер = ЭлектроннаяПодписьСлужебныйКлиент.МенеджерКриптографии("",
		Ложь, ОписаниеОшибки, Объект.Программа);
	
	Если Менеджер = Неопределено Тогда
		Объект.Программа = Неопределено;
		ЭлектроннаяПодписьСлужебныйКлиент.ПоказатьОшибкуОбращенияКПрограмме(
			НСтр("ru = 'Создание ключа электронной подписи'"),, ОписаниеОшибки, Новый Структура);
		
		Возврат;
	КонецЕсли;
	
	ПредставлениеПрограммы = ПоставляемоеПредставлениеПрограммы(СписокПрограмм, Объект.Программа);
	
	СоздатьКлючИЗапросНаСертификат(Новый ОписаниеОповещения(
		"ПерейтиНаСтраницуОтправкаЗаявленияПродолжение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОтправкаЗаявленияПродолжение(Результат, Неопределен) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиНаСтраницуОтправкаЗаявленияНаСервере();
	
	ПослеЗаписи();
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаСтраницуОтправкаЗаявленияНаСервере()
	
	Объект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Подготовлено;
	Объект.Организация = Организация;
	
	ЗаписатьЗаявление();
	
	ПерейтиНаСтраницуОтправкаЗаявленияНаСервереПриЗагрузке(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаСтраницуОтправкаЗаявленияНаСервереПриЗагрузке(Загрузка = Истина)
	
	ПараметрыАутентификацииНаСайте = СтандартныеПодсистемыСервер.ПараметрыАутентификацииНаСайте();
	
	ПриИзмененииРуководителяНаСервере(Загрузка);
	ПриИзмененииПартнераНаСервере(Загрузка);
	
	Элементы.ФормаНазад.Видимость = Ложь;
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтправкаЗаявления;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаОтправкаЗаявления;
	
	Элементы.ИнструкцияИП.Видимость       = ЭтоИндивидуальныйПредприниматель;
	Элементы.ИнструкцияИППункт4.Видимость = ЭтоИндивидуальныйПредприниматель;
	Элементы.ИнструкцияЮЛ.Видимость       = Не ЭтоИндивидуальныйПредприниматель;
	Элементы.ИнструкцияЮЛПункт5.Видимость = Не ЭтоИндивидуальныйПредприниматель;
	
	ОбновитьДоступностьРеквизитовПартнера();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьРеквизитовПартнера()
	
	Элементы.ГруппаПартнер.ТолькоПросмотр = ЗначениеЗаполнено(ИдентификаторДокументооборота);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОжиданиеОбработкиЗаявления()
	
	Если Не РуководительЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПартнерЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументыПечатались
	   И ЗначениеЗаполнено(ДокументыПартнерИНН)
	   И (ДокументыПартнерЭтоИП Или ЗначениеЗаполнено(ДокументыПартнерКПП)) Тогда
		
		ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияПродолжение("Отправить", Неопределено);
		Возврат;
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отправить",   НСтр("ru = 'Отправить'"));
	Кнопки.Добавить("НеОтправить", НСтр("ru = 'Не отправлять'"));
	
	Текст = "";
	Если Не ДокументыПечатались Тогда
		Текст =
			НСтр("ru = 'Документы еще не печатались.
			           |Заявление не будет принято пока не будут получены печатные документы.'");
	КонецЕсли;
	
	Если ДокументыПартнерЭтоИП Тогда
		Если Не ЗначениеЗаполнено(ДокументыПартнерИНН) Тогда
			Текст = Текст + Символы.ПС  + Символы.ПС +
				НСтр("ru = 'Не указан ИНН обслуживающей организации.
				           |Заявление может обрабатываться дольше обычного.'");
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(ДокументыПартнерИНН)
	      Или Не ЗначениеЗаполнено(ДокументыПартнерКПП) Тогда
		
		Текст = Текст + Символы.ПС  + Символы.ПС +
			НСтр("ru = 'Не указан ИНН или КПП обслуживающей организации.
			           |Заявление может обрабатываться дольше обычного.'");
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияПродолжение", ЭтотОбъект),
		СокрЛП(Текст),
		Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияПродолжение(Ответ, Неопределен) Экспорт
	
	Если Ответ <> "Отправить" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыАутентификацииНаСайте) <> Тип("Структура") Тогда
		СтандартныеПодсистемыКлиент.АвторизоватьНаСайтеПоддержкиПользователей(ЭтотОбъект,
			Новый ОписаниеОповещения("ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияЗавершение", ЭтотОбъект));
	Иначе
		ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияЗавершение(ПараметрыАутентификацииНаСайте, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияЗавершение(ПараметрыАутентификации, Неопределен) Экспорт
	
	Если ТипЗнч(ПараметрыАутентификации) <> Тип("Структура") Тогда
		ПараметрыАутентификацииНаСайте = Неопределено;
		// Пользователь отказался от ввода логина и пароля.
		Возврат;
	КонецЕсли;
	
	ПараметрыАутентификацииНаСайте = ПараметрыАутентификации;
	ОписаниеОшибки = "";
	
	Если ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияНаСервере(ОписаниеОшибки) Тогда
		ПослеЗаписи();
	Иначе
		Если ПараметрыАутентификацииНаСайте <> Неопределено Тогда
			ОбработкаПродолжения = Неопределено;
		Иначе
			ОбработкаПродолжения = Новый ОписаниеОповещения(
				"ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияПослеПредупреждения", ЭтотОбъект);
		КонецЕсли;
		ПоказатьПредупреждение(ОбработкаПродолжения, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияПослеПредупреждения(Неопределен) Экспорт
	
	ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияПродолжение("Отправить", Неопределено);
	
КонецПроцедуры

&НаСервере
Функция ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияНаСервере(ОписаниеОшибки)
	
	Если Не ОтправитьЗаявление(ОписаниеОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Объект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Отправлено;
	
	ДатаОбновленияСостояния = ТекущаяДатаСеанса();
	СостояниеОбработкиЗаявления = НСтр("ru = 'Заявление принято для обработки.'");
	ОбновитьДатаОбновленияСостоянияВЗаголовке(ЭтотОбъект);
	
	ЗаписатьЗаявление();
	
	ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияНаСервереПриЗагрузке();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияНаСервереПриЗагрузке()
	
	Элементы.ФормаНапечататьДокументы.Видимость = Истина;
	Элементы.ФормаДалее.Видимость = Ложь;
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОжиданиеОбработкиЗаявления;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаОжиданиеОбработкиЗаявления;
	
	ОбновитьДатаОбновленияСостоянияВЗаголовке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДатаОбновленияСостоянияВЗаголовке(Форма)
	
	Форма.Элементы.СостояниеОбработкиЗаявления.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Состояние обработки заявления (на %1)'"),
		Формат(Форма.ДатаОбновленияСостояния, "ДЛФ=DT"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуУстановкаСертификата()
	
	Результат = ПерейтиНаСтраницуУстановкаСертификатаНаСервере();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> Истина Тогда
		ПослеЗаписи(НСтр("ru = 'Заявление отклонено.'"));
		Закрыть();
		Возврат;
	КонецЕсли;
	
	УстановитьСертификат(Новый ОписаниеОповещения("ПерейтиНаСтраницуУстановкаСертификатаПослеУстановки", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницуУстановкаСертификатаПослеУстановки(Установлен, Неопределен) Экспорт
	
	ОбновитьДатаУстановкиСертификатаВЗаголовке(ЭтотОбъект);
	
	Если Установлен Тогда
		ЗакрытьПомощникПослеУстановкиСертификатаНаСервере();
		ПослеЗаписи(НСтр("ru = 'Заявление исполнено.'"));
		Закрыть();
	Иначе
		ПослеЗаписи();
		ЗаписатьЗаявление();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПерейтиНаСтраницуУстановкаСертификатаНаСервере()
	
	Результат = ПолучитьСертификат();
	Если Результат = Неопределено Тогда
		ОбновитьДатаОбновленияСостоянияВЗаголовке(ЭтотОбъект);
		ЗаписатьЗаявление();
		Возврат Неопределено;
	КонецЕсли;
	
	Если Результат = Истина Тогда
		Объект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.ИсполненоСертификатНеУстановлен;
	Иначе
		Объект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Отклонено;
	КонецЕсли;
	
	ЗаписатьЗаявление();
	
	Если Результат = Истина Тогда
		ПерейтиНаСтраницуУстановкаСертификатаНаСервереПриЗагрузке();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПерейтиНаСтраницуУстановкаСертификатаНаСервереПриЗагрузке()
	
	Элементы.ФормаНапечататьДокументы.Видимость = Ложь;
	Элементы.ФормаНазад.Видимость = Ложь;
	Элементы.ФормаДалее.Видимость = Ложь;
	Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУстановкаСертификата;
	Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаУстановкаСертификата;
	
	ОбновитьДатаУстановкиСертификатаВЗаголовке(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДатаУстановкиСертификатаВЗаголовке(Форма)
	
	Если Не ЗначениеЗаполнено(Форма.ДатаУстановкиСертификата) Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ОшибкаУстановкиСертификата.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка установки сертификата (на %1)'"),
		Формат(Форма.ДатаУстановкиСертификата, "ДЛФ=DT"));
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьПомощникПослеУстановкиСертификата()
	
	УстановитьСертификат(Новый ОписаниеОповещения("ЗакрытьПомощникПослеУстановкиСертификатаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПомощникПослеУстановкиСертификатаЗавершение(Установлен, Неопределен) Экспорт
	
	ОбновитьДатаУстановкиСертификатаВЗаголовке(ЭтотОбъект);
	
	Если Не Установлен Тогда
		ЗаписатьЗаявление();
		Возврат;
	КонецЕсли;
	
	ЗакрытьПомощникПослеУстановкиСертификатаНаСервере();
	
	ПослеЗаписи(НСтр("ru = 'Сертификат установлен.'"));
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПомощникПослеУстановкиСертификатаНаСервере()
	
	Объект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Исполнено;
	
	ЗаписатьЗаявление();
	
	Элементы.ФормаДалее.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияРеквизитыОрганизацииПриИзменении()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОрганизация Тогда
		ПриИзмененииОрганизацииНаСервере();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВладелецСертификата Тогда
		ПриИзмененииВладельцаСертификатаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыОрганизации()
	
	ОчиститьРеквизит("НаименованиеСокращенное");
	ОчиститьРеквизит("НаименованиеПолное");
	ОчиститьРеквизит("ИНН");
	ОчиститьРеквизит("КПП");
	ОчиститьРеквизит("ОГРН");
	ОчиститьРеквизит("РасчетныйСчет");
	ОчиститьРеквизит("БИК");
	ОчиститьРеквизит("КорреспондентскийСчет");
	
	ОчиститьРеквизит("ЮридическийАдрес");
	ЮридическийАдресXML = "";
	
	ОчиститьРеквизит("ФактическийАдрес");
	ФактическийАдресXML = "";
	
	ОчиститьРеквизит("Телефон");
	ТелефонXML = "";
	
	ВидВладельца = "";
	Сотрудник = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизацииНаСервере(Загрузка = Ложь)
	
	Если Не Загрузка Тогда
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("ЭтоИндивидуальныйПредприниматель", Ложь);
		Реквизиты.Вставить("НаименованиеСокращенное");
		Реквизиты.Вставить("НаименованиеПолное");
		Реквизиты.Вставить("ИНН");
		Реквизиты.Вставить("КПП");
		Реквизиты.Вставить("ОГРН");
		Реквизиты.Вставить("РасчетныйСчет");
		Реквизиты.Вставить("БИК");
		Реквизиты.Вставить("КорреспондентскийСчет");
		Реквизиты.Вставить("Телефон");
		Реквизиты.Вставить("ЮридическийАдрес");
		Реквизиты.Вставить("ФактическийАдрес");
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
			Реквизиты.Вставить("Организация",  Организация);
		Иначе
			Реквизиты.Вставить("Организация",  Неопределено);
		КонецЕсли;
		
		ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовОрганизацииВЗаявленииНаСертификат(Реквизиты);
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
			Организация = Реквизиты.Организация;
		КонецЕсли;
		ЭтоИндивидуальныйПредприниматель = Реквизиты.ЭтоИндивидуальныйПредприниматель;
		
		УстановитьРеквизит(Реквизиты, "НаименованиеСокращенное");
		УстановитьРеквизит(Реквизиты, "НаименованиеПолное");
		УстановитьРеквизит(Реквизиты, "ИНН", Истина);
		УстановитьРеквизит(Реквизиты, "ОГРН", Истина);
		УстановитьРеквизит(Реквизиты, "РасчетныйСчет", Истина);
		УстановитьРеквизит(Реквизиты, "БИК", Истина);
		УстановитьРеквизит(Реквизиты, "КорреспондентскийСчет", Истина);
		УстановитьРеквизит(Реквизиты, "Телефон", , Истина, Ложь);
		УстановитьРеквизит(Реквизиты, "ЮридическийАдрес", , Истина, Истина);
		УстановитьРеквизит(Реквизиты, "ФактическийАдрес", , Истина, Истина);
		
		Если Не ЭтоИндивидуальныйПредприниматель Тогда
			УстановитьРеквизит(Реквизиты, "КПП", Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		Элементы.КПП.Видимость = Ложь;
		Элементы.ОГРН.Заголовок = НСтр("ru = 'ОГРНИП'");
	Иначе
		Элементы.КПП.Видимость = Истина;
		Элементы.ОГРН.Заголовок = НСтр("ru = 'ОГРН'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОрганизацияЗаполнена()
	
	Отказ = Ложь;
	
	Если Элементы.Организация.Видимость
	   И Не ПроверитьРеквизит(Отказ, "Организация") Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	ПроверитьРеквизит(Отказ, "НаименованиеСокращенное");
	ПроверитьРеквизит(Отказ, "НаименованиеПолное");
	
	Если ПроверитьРеквизит(Отказ, "ИНН") Тогда
		ТекстСообщения = "";
		РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН,
			Не ЭтоИндивидуальныйПредприниматель, ТекстСообщения);
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ИНН", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоИндивидуальныйПредприниматель
	   И ПроверитьРеквизит(Отказ, "КПП") Тогда
		
		ТекстСообщения = "";
		РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КПП", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверитьРеквизит(Отказ, "ОГРН") Тогда
		ТекстСообщения = "";
		РегламентированныеДанныеКлиентСервер.ОГРНСоответствуетТребованиям(ОГРН,
			Не ЭтоИндивидуальныйПредприниматель, ТекстСообщения);
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ОГРН", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РасчетныйСчет) Тогда
		ТекстСообщения = "";
		РасчетныйСчетСоответствуетТребованиям(РасчетныйСчет, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "РасчетныйСчет", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БИК) Тогда
		ТекстСообщения = "";
		БИКСоответствуетТребованиям(БИК, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "БИК", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КорреспондентскийСчет) Тогда
		ТекстСообщения = "";
		КорреспондентскийСчетСоответствуетТребованиям(КорреспондентскийСчет, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КорреспондентскийСчет", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверитьРеквизит(Отказ, "ЮридическийАдрес") Тогда
		ТекстСообщения = "";
		АдресСоответствуетТребованиям(ЮридическийАдресXML, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ЮридическийАдрес", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверитьРеквизит(Отказ, "ФактическийАдрес") Тогда
		ТекстСообщения = "";
		АдресСоответствуетТребованиям(ФактическийАдресXML, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ФактическийАдрес", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверитьРеквизит(Отказ, "Телефон") Тогда
		ТекстСообщения = "";
		ТелефонСоответствуетТребованиям(ТелефонXML, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Телефон", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ПроверитьАдрес(ИмяРеквизита)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	Сообщение = "";
	Попытка
		ПодробныйИтог = МодульУправлениеКонтактнойИнформацией.ПроверитьАдрес(ЭтотОбъект[ИмяРеквизита + "XML"]);
		
		Если ПодробныйИтог.Результат <> "Корректный" Тогда
			Для каждого ЭлементСписка Из ПодробныйИтог.СписокОшибок Цикл
				Сообщение = Сообщение + Символы.ПС + ЭлементСписка.Представление;
			КонецЦикла;
			Сообщение = СокрЛП(Сообщение);
			Если Не ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = НСтр("ru = 'Адрес не заполнен'");
			КонецЕсли;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Сообщение = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Сообщение) Тогда
		Элементы[ИмяРеквизита + "Предупреждение"].Подсказка = Сообщение;
		Элементы[ИмяРеквизита + "Предупреждение"].Видимость = Истина;
	Иначе
		Элементы[ИмяРеквизита + "Предупреждение"].Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РасчетныйСчетСоответствуетТребованиям(РасчетныйСчет, ТекстСообщения)
	
	Значение = СокрЛП(РасчетныйСчет);
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Значение) Тогда
		ТекстСообщения = НСтр("ru = 'Расчетный счет должен состоять только из цифр.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(Значение) <> 20 Тогда
		ТекстСообщения = НСтр("ru = 'Расчетный счет должен состоять из 20 цифр.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не РегламентированныеДанныеКлиентСервер.КонтрольныйКлючЛицевогоСчетаСоответствуетТребованиям(Значение, БИК) Тогда
		ТекстСообщения = НСтр("ru = 'Контрольное число счета не совпадает с рассчитанным с учетом БИК'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция БИКСоответствуетТребованиям(БИК, ТекстСообщения)
	
	Значение = СокрЛП(БИК);
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Значение) Тогда
		ТекстСообщения = НСтр("ru = 'БИК должен состоять только из цифр.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(Значение) <> 9 Тогда
		ТекстСообщения = НСтр("ru = 'БИК должен состоять из 9 цифр.'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция КорреспондентскийСчетСоответствуетТребованиям(КорреспондентскийСчет, ТекстСообщения)
	
	Значение = СокрЛП(КорреспондентскийСчет);

	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Значение) Тогда
		ТекстСообщения = НСтр("ru = 'Корреспондентский счет должен состоять только из цифр.'");
		Возврат Ложь;
	КонецЕсли;

	Если СтрДлина(Значение) <> 20 Тогда
		ТекстСообщения = НСтр("ru = 'Корреспондентский счет должен состоять из 20 цифр.'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция АдресСоответствуетТребованиям(Знач АдресMXL, ТекстСообщения)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ТекстСообщения = "";
	АдресСтруктура = МодульУправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(АдресMXL);
	
	// Проверка, что адрес российский.
	Если Не АдресСтруктура.Свойство("КодРегиона") Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Это не российский адрес'");
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка, что указан регион.
	Если Не АдресСтруктура.Свойство("Регион") Или Не ЗначениеЗаполнено(АдресСтруктура.Регион) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не указан регион'");
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка, что регион указан правильно - код региона определен.
	Если Не ЗначениеЗаполнено(АдресСтруктура.КодРегиона) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Некорректный регион (код региона не определен)'");
		Возврат Ложь; 
	КонецЕсли;
	
	// Населенный пункт полностью.
	НаселенныйПунктПолностью = НаселенныйПунктПолностью(АдресСтруктура);
	Если Не ЗначениеЗаполнено(НаселенныйПунктПолностью) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не указан населенный пункт'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НаселенныйПунктПолностью(АдресСтруктура)
	
	// Район РайонСокращение, Город ГородСокращение, НаселенныйПункт НаселенныйПунктСокращение.
	Итог = "";
	
	Если АдресСтруктура.Свойство("Регион")
	   И АдресСтруктура.Свойство("КодРегиона")
	   И (    АдресСтруктура.КодРегиона = "77"
	      Или АдресСтруктура.КодРегиона = "78"
	      Или АдресСтруктура.КодРегиона = "92"
	      Или АдресСтруктура.КодРегиона = "99") Тогда
		
		Итог = СокрЛП(АдресСтруктура.Регион);
	КонецЕсли;
	
	Если АдресСтруктура.Свойство("Район")
	   И ЗначениеЗаполнено(АдресСтруктура.Район) Тогда
		
		Итог = Итог + ?(ЗначениеЗаполнено(Итог), ", ", "");
		Итог = Итог + СокрЛП(АдресСтруктура.Район);
	КонецЕсли;
	
	Если АдресСтруктура.Свойство("Город")
	   И ЗначениеЗаполнено(АдресСтруктура.Город) Тогда
		
		Итог = Итог + ?(ЗначениеЗаполнено(Итог), ", ", "");
		Итог = Итог + СокрЛП(АдресСтруктура.Город);
	КонецЕсли;
	
	Если АдресСтруктура.Свойство("НаселенныйПункт")
	   И ЗначениеЗаполнено(АдресСтруктура.НаселенныйПункт) Тогда
		
		Итог = Итог + ?(ЗначениеЗаполнено(Итог), ", ", "");
		Итог = Итог + СокрЛП(АдресСтруктура.НаселенныйПункт);
	КонецЕсли;
	
	Возврат Итог;
	
КонецФункции

&НаСервере
Функция ТелефонСоответствуетТребованиям(Знач ТелефонXML, ТекстСообщения)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	ТекстСообщения = "";
	ТелефонСтруктура = МодульУправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(ТелефонXML);
	
	// Проверка, что телефон российский.
	Если СтрЗаменить(ТелефонСтруктура.КодСтраны, "+", "") <> "7" Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Код страны не российский (должен быть ""7"")'");
		Возврат Ложь;
	КонецЕсли;
	
	НомерТелефонаБезКодаСтраны = ТелефонСтруктура.КодГорода + ТелефонСтруктура.НомерТелефона;
	
	Если Не ЗначениеЗаполнено(НомерТелефонаБезКодаСтраны) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не заполнен номер телефона'");
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(ТолькоЦифры(НомерТелефонаБезКодаСтраны)) <> 10 Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Номер телефона с кодом города должен состоять из 10-и цифр'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОжиданияРеквизитыВладельцаПриИзменении()
	
	ПриИзмененииВладельцаСертификатаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыВладельца()
	
	ОчиститьРеквизит("Фамилия");
	ОчиститьРеквизит("Имя");
	ОчиститьРеквизит("Отчество");
	ОчиститьРеквизит("СтраховойНомерПФР");
	ОчиститьРеквизит("Должность");
	ОчиститьРеквизит("Подразделение");
	
	Если Элементы.ДокументВид.ТолькоПросмотр Тогда
		ДокументВид = 21;
	КонецЕсли;
	
	ОчиститьРеквизит("ДокументНомер");
	ОчиститьРеквизит("ДокументКемВыдан");
	ОчиститьРеквизит("ДокументДатаВыдачи");
	ОчиститьРеквизит("ЭлектроннаяПочта");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВладельцаСертификатаНаСервере(Загрузка = Ложь)
	
	Если Не ЗначениеЗаполнено(ВидВладельца) Тогда
		ВидВладельца = "Директор";
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ВидВладельца", ВидВладельца);
	Реквизиты.Вставить("Директор");
	Реквизиты.Вставить("ГлавныйБухгалтер");
	Реквизиты.Вставить("Сотрудник", Сотрудник);
	Реквизиты.Вставить("Пользователь");
	Реквизиты.Вставить("Фамилия");
	Реквизиты.Вставить("Имя");
	Реквизиты.Вставить("Отчество");
	Реквизиты.Вставить("СтраховойНомерПФР");
	Реквизиты.Вставить("Должность");
	Реквизиты.Вставить("Подразделение");
	Реквизиты.Вставить("ДокументВид");
	Реквизиты.Вставить("ДокументНомер");
	Реквизиты.Вставить("ДокументКемВыдан");
	Реквизиты.Вставить("ДокументДатаВыдачи");
	Реквизиты.Вставить("ЭлектроннаяПочта");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
		Реквизиты.Вставить("Организация", Организация);
	Иначе
		Реквизиты.Вставить("Организация", Неопределено);
	КонецЕсли;
	
	Если СотрудникТип <> Неопределено Тогда
		Реквизиты.Вставить("Сотрудник", Сотрудник);
	Иначе
		Реквизиты.Вставить("Сотрудник", Неопределено);
	КонецЕсли;
	
	Реквизиты.Вставить("ТипВладельца");
	
	ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовВладельцаВЗаявленииНаСертификат(Реквизиты);
	
	ЗаполнитьТипыЗначения(СотрудникТип, Элементы.Сотрудник, Реквизиты.ТипВладельца);
	
	Если СотрудникТип = Неопределено Тогда
		СотрудникТип = Неопределено;
		Элементы.ВыборВладельцаСертификата.Видимость = Ложь;
	Иначе
		Список = Элементы.ВидВладельца.СписокВыбора;
		Список.Очистить();
		Элементы.Директор.Видимость = Ложь;
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		
		Если ЭтоИндивидуальныйПредприниматель Тогда
			ВидВладельца = "Сотрудник";
		Иначе
			Если Реквизиты.Директор <> Неопределено Тогда
				Список.Добавить("Директор", НСтр("ru = 'Директор'"));
				Элементы.Директор.Видимость = Истина;
				
			ИначеЕсли ВидВладельца = "Директор" Тогда
				ВидВладельца = "ГлавныйБухгалтер";
			КонецЕсли;
			
			Если Реквизиты.ГлавныйБухгалтер <> Неопределено Тогда
				Список.Добавить("ГлавныйБухгалтер", НСтр("ru = 'Главный бухгалтер'"));
				Элементы.ГлавныйБухгалтер.Видимость = Истина;
				
			ИначеЕсли ВидВладельца = "ГлавныйБухгалтер" Тогда
				ВидВладельца = "Сотрудник";
			КонецЕсли;
		КонецЕсли;
		
		Если Список.Количество() = 0 Тогда
			Элементы.ВидВладельца.Видимость = Ложь;
			Элементы.Сотрудник.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
			Если ЭтоИндивидуальныйПредприниматель Тогда
				Элементы.Сотрудник.Заголовок = НСтр("ru = 'Индивидуальный предприниматель'");
			Иначе
				Элементы.Сотрудник.Заголовок = НСтр("ru = 'Сотрудник'");
			КонецЕсли;
		Иначе
			Список.Добавить("Сотрудник", НСтр("ru = 'Сотрудник'"));
			Элементы.ВидВладельца.Видимость = Истина;
			Элементы.Сотрудник.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		КонецЕсли;
		
		Элементы.Сотрудник.АвтоОтметкаНезаполненного = ВидВладельца = "Сотрудник";
	
		Директор         = Реквизиты.Директор;
		ГлавныйБухгалтер = Реквизиты.ГлавныйБухгалтер;
		Сотрудник        = ?(Загрузка, Сотрудник, Реквизиты.Сотрудник);
	КонецЕсли;
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		Элементы.Должность.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Сотрудник.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Должность.Видимость = Истина;
		Элементы.Подразделение.Видимость = Истина;
		Элементы.Сотрудник.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если Загрузка Тогда
		ПриИзмененииВидаДокументаНаСервере();
		Возврат;
	КонецЕсли;
	
	Объект.Пользователь = Реквизиты.Пользователь;
	
	УстановитьРеквизит(Реквизиты, "Фамилия");
	УстановитьРеквизит(Реквизиты, "Имя");
	УстановитьРеквизит(Реквизиты, "Отчество");
	УстановитьРеквизит(Реквизиты, "СтраховойНомерПФР", Истина);
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		Должность = "";
		Подразделение = "";
	Иначе
		УстановитьРеквизит(Реквизиты, "Должность");
		УстановитьРеквизит(Реквизиты, "Подразделение");
	КонецЕсли;

	УстановитьРеквизит(Реквизиты, "ДокументВид", Истина);
	УстановитьРеквизит(Реквизиты, "ДокументНомер", Истина);
	УстановитьРеквизит(Реквизиты, "ДокументКемВыдан");
	УстановитьРеквизит(Реквизиты, "ДокументДатаВыдачи", , Истина);
	
	УстановитьРеквизит(Реквизиты, "ЭлектроннаяПочта", , , Ложь);
	
	ПриИзмененииВидаДокументаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаДокументаНаСервере()
	
	Если ДокументВид = "" Тогда
		ДокументВид = "21";
	КонецЕсли;
	
	Если ДокументВид = "21" Тогда
		Элементы.ДокументНомер.Заголовок = НСтр("ru = 'Серия и номер'");
		Элементы.ДокументНомер.Маска = "99 99 999999";
	Иначе
		Элементы.ДокументНомер.Заголовок = НСтр("ru = 'Номер'");
		Элементы.ДокументНомер.Маска = "";
	КонецЕсли;
	
	Если ДокументВид = 91 Тогда
		ДокументВид = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВладелецЗаполнен()
	
	Отказ = Ложь;
	
	Если Элементы.ВыборВладельцаСертификата.Видимость
	   И Не ПроверитьРеквизит(Отказ, ВидВладельца) Тогда
		
		Возврат Ложь;
	КонецЕсли;
		
	ПроверитьРеквизит(Отказ, "Фамилия");
	ПроверитьРеквизит(Отказ, "Имя");
	ПроверитьРеквизит(Отказ, "Отчество");
	
	Если ПроверитьРеквизит(Отказ, "СтраховойНомерПФР") Тогда
		ТекстСообщения = "";
		РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(СтраховойНомерПФР, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "СтраховойНомерПФР", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтоИндивидуальныйПредприниматель Тогда
		ПроверитьРеквизит(Отказ, "Должность");
	КонецЕсли;
	
	ПроверитьРеквизит(Отказ, "ДокументВид");
	
	Если ДокументВид = "21"
	   И ПроверитьРеквизит(Отказ, "ДокументНомер") Тогда
		
		ТекстСообщения = "";
		НомерПаспортаРФСоответствуетТребованиям(ДокументНомер, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ДокументНомер", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьРеквизит(Отказ, "ДокументКемВыдан");
	ПроверитьРеквизит(Отказ, "ДокументДатаВыдачи");
	
	Если ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
		ТекстСообщения = "";
		Попытка
			ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ЭлектроннаяПочта);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ЭлектроннаяПочта", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Функция НомерПаспортаРФСоответствуетТребованиям(Знач НомерПаспортаРФ, ТекстСообщения)
	
	ТекстСообщения = "";
	
	Результат = Истина;
	
	СтрокаЦифр = СтрЗаменить(НомерПаспортаРФ, ",", "");
	СтрокаЦифр = СтрЗаменить(СтрокаЦифр, " ", "");
	
	Если ПустаяСтрока(СтрокаЦифр) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Номер паспорта не заполнен'");
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(СтрокаЦифр) < 10 Тогда
		ТекстСообщения  =  ТекстСообщения + НСтр("ru = 'Номер паспорта задан неполностью'");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаЦифр) Тогда
		Результат = Ложь;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Номер паспорта должен состоять только из цифр.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииРуководителяНаСервере(Загрузка = Ложь)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Представление");
	Реквизиты.Вставить("Должность");
	Реквизиты.Вставить("Основание");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
		Реквизиты.Вставить("Организация", Организация);
	Иначе
		Реквизиты.Вставить("Организация", Неопределено);
	КонецЕсли;
	
	Если ДокументыРуководительТип <> Неопределено Тогда
		Реквизиты.Вставить("Руководитель", ДокументыРуководительСсылка);
	Иначе
		Реквизиты.Вставить("Руководитель", Неопределено);
	КонецЕсли;
	Реквизиты.Вставить("ТипРуководителя");
	
	ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовРуководителяВЗаявленииНаСертификат(Реквизиты);
	
	ЗаполнитьТипыЗначения(ДокументыРуководительТип, Элементы.ДокументыРуководитель, Реквизиты.ТипРуководителя);
	Элементы.ДокументыРуководитель.КнопкаВыбора = ДокументыРуководительТип <> Неопределено;
	
	Если Загрузка Тогда
		Элементы.ДокументыРуководитель.КнопкаОткрытия = ЗначениеЗаполнено(ДокументыРуководительСсылка);
		Возврат;
	КонецЕсли;
	
	ДокументыРуководительСсылка = ?(ДокументыРуководительТип <> Неопределено, Реквизиты.Руководитель, Неопределено);
	Элементы.ДокументыРуководитель.КнопкаОткрытия = ЗначениеЗаполнено(ДокументыРуководительСсылка);
	ДокументыРуководитель = ?(Реквизиты.Представление <> Неопределено, Реквизиты.Представление, Реквизиты.Руководитель);
	
	ДокументыРуководительДолжность = Реквизиты.Должность;
	ДокументыРуководительОснование = Реквизиты.Основание;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияРеквизитыРуководителяПриИзменении()
	
	ПриИзмененииРуководителяНаСервере();
	
КонецПроцедуры

&НаСервере
Функция РуководительЗаполнен()
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		Возврат Истина;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьРеквизит(Отказ, "ДокументыРуководитель");
	ПроверитьРеквизит(Отказ, "ДокументыРуководительДолжность");
	ПроверитьРеквизит(Отказ, "ДокументыРуководительОснование");
	
	Возврат Не Отказ;
	
КонецФункции


&НаСервере
Процедура ПриИзмененииПартнераНаСервере(Загрузка = Ложь)
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Представление");
	Реквизиты.Вставить("ЭтоИндивидуальныйПредприниматель", Ложь);
	Реквизиты.Вставить("ИНН");
	Реквизиты.Вставить("КПП");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
		Реквизиты.Вставить("Организация", Организация);
	Иначе
		Реквизиты.Вставить("Организация", Неопределено);
	КонецЕсли;
	
	Если ДокументыПартнерТип <> Неопределено Тогда
		Реквизиты.Вставить("Партнер", ДокументыПартнерСсылка);
	Иначе
		Реквизиты.Вставить("Партнер", Неопределено);
	КонецЕсли;
	Реквизиты.Вставить("ТипПартнера");
	
	ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовПартнераВЗаявленииНаСертификат(Реквизиты);
	
	ЗаполнитьТипыЗначения(ДокументыПартнерТип, Элементы.ДокументыПартнер, Реквизиты.ТипПартнера);
	Элементы.ДокументыПартнер.КнопкаВыбора = ДокументыПартнерТип <> Неопределено;
	
	Если Загрузка Тогда
		Элементы.ДокументыПартнер.КнопкаОткрытия = ЗначениеЗаполнено(ДокументыПартнерСсылка);
		Возврат;
	КонецЕсли;
	
	ДокументыПартнерСсылка = ?(ДокументыПартнерТип <> Неопределено, Реквизиты.Партнер, Неопределено);
	Элементы.ДокументыПартнер.КнопкаОткрытия = ЗначениеЗаполнено(ДокументыПартнерСсылка);
	
	ДокументыПартнер = ?(Реквизиты.Представление <> Неопределено, Реквизиты.Представление, Реквизиты.Партнер);
	
	ДокументыПартнерЭтоИП = Реквизиты.ЭтоИндивидуальныйПредприниматель;
	
	РеквизитыФормы = Новый Структура;
	РеквизитыФормы.Вставить("ДокументыПартнерИНН", Реквизиты.ИНН);
	РеквизитыФормы.Вставить("ДокументыПартнерКПП", Реквизиты.КПП);
	
	УстановитьРеквизит(РеквизитыФормы, "ДокументыПартнерИНН", Истина);
	
	Если ДокументыПартнерЭтоИП Тогда
		Элементы.ДокументыПартнерКПП.Видимость = Ложь;
	Иначе
		УстановитьРеквизит(РеквизитыФормы, "ДокументыПартнерКПП", Истина);
		Элементы.ДокументыПартнерКПП.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияРеквизитыПартнераПриИзменении()
	
	ПриИзмененииПартнераНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыПартнера()
	
	ОчиститьРеквизит("ДокументыПартнерИНН");
	ОчиститьРеквизит("ДокументыПартнерКПП");
	
КонецПроцедуры

&НаСервере
Функция ПартнерЗаполнен()
	
	Отказ = Ложь;
	
	Если ЗначениеЗаполнено(ДокументыПартнерИНН) Тогда
		ТекстСообщения = "";
		РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ДокументыПартнерИНН,
			Не ДокументыПартнерЭтоИП, ТекстСообщения);
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ДокументыПартнерИНН", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДокументыПартнерЭтоИП
	   И ЗначениеЗаполнено(ДокументыПартнерКПП) Тогда
		
		ТекстСообщения = "";
		РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(ДокументыПартнерКПП, ТекстСообщения);
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ДокументыПартнерКПП", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции


&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ЭтотОбъект[Элемент.Имя]) = Тип("Строка") Тогда
		ИмяРеквизита = Элемент.Имя;
		ИмяРеквизитаЗначения = Элемент.Имя + "Ссылка";
	Иначе
		ИмяРеквизита = Элемент.Имя;
		ИмяРеквизитаЗначения = Элемент.Имя;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаЗначения", ИмяРеквизитаЗначения);
	
	Если ТипЗнч(ЭтотОбъект[ИмяРеквизита + "Тип"]) <> Тип("СписокЗначений") Тогда
		Возврат;
	ИначеЕсли ЭтотОбъект[ИмяРеквизита + "Тип"].Количество() = 1 Тогда
		ЗначениеНачалоВыбораПослеВыбораТипа(ЭтотОбъект[ИмяРеквизита + "Тип"][0], ДополнительныеПараметры);
	Иначе
		СписокВыбораТипов = Новый СписокЗначений;
		СписокВыбораТипов.ЗагрузитьЗначения(ЭтотОбъект[ИмяРеквизита + "Тип"].ВыгрузитьЗначения());
		СписокВыбораТипов.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения("ЗначениеНачалоВыбораПослеВыбораТипа", ЭтотОбъект, ДополнительныеПараметры),
			НСтр("ru = 'Выбор типа данных'"),
			ЭтотОбъект[ИмяРеквизита + "Тип"].НайтиПоЗначению(ТипЗнч(ЭтотОбъект[ИмяРеквизитаЗначения])));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбораПослеВыбораТипа(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент              = ДополнительныеПараметры.Элемент;
	ИмяРеквизита         = ДополнительныеПараметры.ИмяРеквизита;
	ИмяРеквизитаЗначения = ДополнительныеПараметры.ИмяРеквизитаЗначения;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ЭлементСписка.Значение);
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	
	НачальноеЗначение = ОписаниеТипов.ПривестиЗначение(ЭтотОбъект[ИмяРеквизитаЗначения]);
	
	Если ИмяРеквизита = ИмяРеквизитаЗначения Тогда
		ЭтотОбъект[ИмяРеквизитаЗначения] = НачальноеЗначение;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", НачальноеЗначение);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ИмяФормыВыбора = ЭтотОбъект[Элемент.Имя + "Тип"].НайтиПоЗначению(ТипЗнч(НачальноеЗначение)).Представление
		+ ".ФормаВыбора";
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Значение = ЭтотОбъект[Элемент.Имя + "Ссылка"];
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ПоказатьЗначение(, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтотОбъект[Элемент.Имя + "Ссылка"] = ВыбранноеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыЗначения(РеквизитТип, Элемент, ОписаниеТипов);
	
	Если ТипЗнч(ОписаниеТипов) <> Тип("ОписаниеТипов") Тогда
		РеквизитТип = Неопределено;
	Иначе
		СоставТипов = Новый СписокЗначений;
		Для каждого Тип Из ОписаниеТипов.Типы() Цикл
			Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
				СоставТипов.Добавить(Тип, Строка(Тип));
			КонецЕсли;
		КонецЦикла;
		СоставТипов.СортироватьПоПредставлению();
		Для каждого ЭлементСписка Из СоставТипов Цикл
			ЭлементСписка.Представление = Метаданные.НайтиПоТипу(ЭлементСписка.Значение).ПолноеИмя();
		КонецЦикла;
		
		Если СоставТипов.Количество() = 0 Тогда
			РеквизитТип = Неопределено;
		Иначе
			РеквизитТип = СоставТипов;
			Элемент.ВыбиратьТип = РеквизитТип.Количество() > 1;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизит(ИмяРеквизита)
	
	ЭтотОбъект[ИмяРеквизита] = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизит(Реквизиты, ИмяРеквизита, ТолькоЦифры = Ложь, КнопкаВыбора = Ложь, ЭтоАдрес = Неопределено)
	
	Если Реквизиты[ИмяРеквизита] = Неопределено Тогда
		ЭтотОбъект[ИмяРеквизита] = Неопределено;
		Если ЭтоАдрес <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита + "XML"] = "";
			Если ЭтоАдрес = Истина Тогда
				ПроверитьАдрес(ИмяРеквизита);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЭтоАдрес <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита + "XML"] = Реквизиты[ИмяРеквизита];
			
			Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
				МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
				
				ЭтотОбъект[ИмяРеквизита] = МодульУправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(
					Реквизиты[ИмяРеквизита]);
				
				Если ЭтоАдрес = Истина Тогда
					ПроверитьАдрес(ИмяРеквизита);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТолькоЦифры Тогда
			ЭтотОбъект[ИмяРеквизита] = ТолькоЦифры(Реквизиты[ИмяРеквизита]);
		Иначе
			ЭтотОбъект[ИмяРеквизита] = Реквизиты[ИмяРеквизита];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТолькоЦифры(Строка)
	
	ДлинаСтроки = СтрДлина(Строка);
	
	ОбработаннаяСтрока = "";
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если Символ >= "0" И Символ <= "9" Тогда
			ОбработаннаяСтрока = ОбработаннаяСтрока + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбработаннаяСтрока;
	
КонецФункции

&НаСервере
Функция ПроверитьРеквизит(Отказ, ИмяРеквизита)
	
	Элемент = Элементы[ИмяРеквизита];
	
	Если ЗначениеЗаполнено(Элемент.Заголовок) Тогда
		ЗаголовокПоля = Элемент.Заголовок;
	Иначе
		ЗаголовокПоля = ЗаголовкиРеквизитов.НайтиПоЗначению(ИмяРеквизита);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Поле ""%1"" не заполнено'"), ЗаголовокПоля), , ИмяРеквизита, , Отказ);
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаСервере
Функция ПодготовленныйДокумент()
	
	Если Не РуководительЗаполнен() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Макет = Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПолучитьМакет(
		?(ЭтоИндивидуальныйПредприниматель,
			"ЗаявлениеНаСертификатИндивидуальногоПредпринимателя",
			"ЗаявлениеНаСертификатЮридическогоЛица"));
	
	Документ = Новый ТабличныйДокумент;
	ЗаполнитьЗначенияСвойств(Макет.Параметры, ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(Макет.Параметры, ДокументыПоляСертификата);
	
	Макет.Параметры.Телефон = Телефон;
	
	ДокументВидПредставление = Элементы.ДокументВид.СписокВыбора.НайтиПоЗначению(ДокументВид).Представление;
	ДокументВидПредставление = НРег(Лев(ДокументВидПредставление, 1)) + Сред(ДокументВидПредставление, 2);
	
	ДокументНомерПредставление =
		?(ДокументВид = "21", ПредставлениеРеквизитаНомерПаспортаРФ(ДокументНомер), ДокументНомер);
	
	ДокументДатаВыдачиПредставление = ПредставлениеРеквизитаДокументДатаВыдачи(ДокументДатаВыдачи);
	
	Макет.Параметры.УдостоверениеЛичности = ДокументВидПредставление + " " + ДокументНомерПредставление + " "
		+ НСтр("ru = 'от'") + " " + ДокументДатаВыдачиПредставление + " "
		+ НСтр("ru = 'выданный'") + " " + ДокументКемВыдан;
	
	Документ.Вывести(Макет);
	
	Возврат Документ;
	
КонецФункции

&НаСервере
Функция ОтправитьЗаявление(ОписаниеОшибки)
	
	ОписаниеОшибки = "";
	ШаблонОписанияОшибки =
		НСтр("ru = 'Не удалось отправить заявление по причине:
		           |%1'");
	
	Попытка
		ВебСервис = ВебСервисУЦ();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияОшибки,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Ложь;
	КонецПопытки;
	
	Билет = БилетНаСайтПоддержки(ОписаниеОшибки);
	Если Не ЗначениеЗаполнено(Билет) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоПовторнаяОтправкаПакета = Истина;
	Если Не ЗначениеЗаполнено(ИдентификаторДокументооборота) Тогда
		ЭтоПовторнаяОтправкаПакета = Ложь;
		ИдентификаторДокументооборота = НовыйСжатыйУникальныйИдентификатор();
	КонецЕсли;
	
	ЗаявлениеXML = ЗаявлениеXML(Билет);
	ПакетЗаявления = ПакетЗаявления(ЗаявлениеXML);
	
	ОбновитьДоступностьРеквизитовПартнера();
	
	Попытка
		Ответ = ВебСервис.SendPacket(ПакетЗаявления);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияОшибки,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Ложь;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Ответ) Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияОшибки,
			НСтр("ru = 'Сервер вернул пустой ответ.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Ответ);
	ПостроительDOM = Новый ПостроительDOM();
	ПостроительDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("code");
	КодРезультата = УзелDOM[0].ТекстовоеСодержимое;
	
	Если КодРезультата = "0" Тогда
		ДатаОтправки = ТекущаяДатаСеанса();
		Возврат Истина;
		
	ИначеЕсли КодРезультата = "60" // Документооборот уже зарегистрирован.
	        И ЭтоПовторнаяОтправкаПакета Тогда
		
		ДатаОтправки = ТекущаяДатаСеанса();
		Возврат Истина;
	КонецЕсли;
	
	ИдентификаторДокументооборота = "";
	
	ОбновитьДоступностьРеквизитовПартнера();
	
	УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("errorMessage");
	Если УзелDOM.Количество() > 0 Тогда
		ОписаниеОшибки = УзелDOM[0].ТекстовоеСодержимое;
	КонецЕсли;
	
	Если КодРезультата = "202" Тогда
		ОписаниеОшибки =
			НСтр("ru = 'Не удалось проверить действительность подписки на ИТС (its.1c.ru) по причине:
			           |Билет, полученный по имени пользователя и паролю неверный или устарел.
			           |
			           |Попробуйте отправить заявление еще раз.'");
	Иначе
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияОшибки,
			ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция БилетНаСайтПоддержки(ОписаниеОшибки)
	
	Билет = "";
	Попытка
		ВебСервис = ОбщегоНазначения.WSПрокси(
			"https://login.1c.ru/api/public/ticket?wsdl",
			"http://api.cas.jasig.org/",
			"TicketApiImplService",
			"TicketApiImplPort",
			ПараметрыАутентификацииНаСайте.Логин,
			ПараметрыАутентификацииНаСайте.Пароль,
			5,
			Ложь);
		
		Билет = ВебСервис.getTicket(
			ПараметрыАутентификацииНаСайте.Логин,
			ПараметрыАутентификацииНаСайте.Пароль,
			"http://regservice.1c.ru");
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Если Найти(КраткоеПредставлениеОшибки, "IncorrectLoginOrPasswordApiException") > 0 Тогда
			КраткоеПредставлениеОшибки = НСтр("ru = 'Некорректное имя пользователя или пароль.'");
			ПараметрыАутентификацииНаСайте = Неопределено;
		КонецЕсли;
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось подключиться к сайту поддержки по причине:
			           |%1'"),
			КраткоеПредставлениеОшибки);
	КонецПопытки;
	
	Возврат Билет;
	
КонецФункции

&НаСервере
Функция ЗаявлениеXML(Билет)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Заявление");
	ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "1.3");
	ЗаписьXML.ЗаписатьАтрибут("ДатаВремяФормирования", XMLСтрока(ТекущаяДатаСеанса()));
	ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "1С");
	
		ЗаписьXMLЭлемент(ЗаписьXML, "ТипЗаявления", "1");
		ЗаписьXMLЭлемент(ЗаписьXML, "ПризнакЮридическогоЛица", Не ЭтоИндивидуальныйПредприниматель);
		ЗаписьXMLЭлемент(ЗаписьXML, "ИНН");
		
		Если Не ЭтоИндивидуальныйПредприниматель Тогда
			ЗаписьXMLЭлемент(ЗаписьXML, "КПП");
		КонецЕсли;
		
		ЗаписьXMLЭлемент(ЗаписьXML, "ОГРН");
		ЗаписьXMLЭлемент(ЗаписьXML, "ПолноеНаименование",  НаименованиеПолное);
		ЗаписьXMLЭлемент(ЗаписьXML, "КраткоеНаименование", НаименованиеСокращенное);
		ЗаписьXMLЭлемент(ЗаписьXML, "ТелефонОсновной",     Телефон);
		
		ЗаписьXMLАдрес(ЗаписьXML, "АдресЮридический", ЮридическийАдресXML);
		ЗаписьXMLАдрес(ЗаписьXML, "АдресФактический", ФактическийАдресXML);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВладельцыЭЦП");
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВладелецЭЦП");
		ЗаписьXML.ЗаписатьАтрибут("СНИЛС", ПредставлениеРеквизитаСтраховойНомерПФР(СтраховойНомерПФР));
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("ФИО");
			ЗаписьXML.ЗаписатьАтрибут("Фамилия",  Фамилия);
			ЗаписьXML.ЗаписатьАтрибут("Имя",      Имя);
			ЗаписьXML.ЗаписатьАтрибут("Отчество", Отчество);
			ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента ФИО.
			
			Если ДокументВид = "21" Тогда
				ДокументНомерПредставление = ПредставлениеРеквизитаНомерПаспортаРФ(ДокументНомер);
			Иначе
				ДокументНомерПредставление = ДокументНомер;
			КонецЕсли;
			ДокументДатаВыдачиПредставление = ПредставлениеРеквизитаДокументДатаВыдачи(ДокументДатаВыдачи);
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("УдЛичн");
			ЗаписьXML.ЗаписатьАтрибут("КодВидДок", ДокументВид);
			ЗаписьXML.ЗаписатьАтрибут("СерНомДок", ДокументНомерПредставление);
			ЗаписьXML.ЗаписатьАтрибут("ДатаДок",   ДокументДатаВыдачиПредставление);
			ЗаписьXML.ЗаписатьАтрибут("ВыдДок",    ДокументКемВыдан);
			ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента УдЛичн.
			
			Если Не ЭтоИндивидуальныйПредприниматель Тогда
				ЗаписьXMLЭлемент(ЗаписьXML, "Должность",  Должность);
			КонецЕсли;
			
			ЗаписьXMLЭлемент(ЗаписьXML, "ЭлектроннаяПочта", ЭлектроннаяПочта);
			
			Строки = СписокПрограмм.НайтиСтроки(Новый Структура("Ссылка", Объект.Программа));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Криптопровайдер");
			ЗаписьXMLЭлемент(ЗаписьXML, "ТипКриптопровайдера", XMLСтрока(Строки[0].ТипПрограммы));
			ЗаписьXMLЭлемент(ЗаписьXML, "ИмяКриптопровайдера", XMLСтрока(Строки[0].ИмяПрограммы));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента Криптопровайдер.
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ЗапросНаСертификат");
			ЗаписьXML.ЗаписатьАтрибут("УдостоверяющийЦентр", "ООО ""НПЦ ""1С""");
			ЗаписьXML.ЗаписатьТекст(ТекстФайлаЗапросаНаСертификат());
			ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента ЗапросНаСертификат.
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента ВладелецЭЦП.
		ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента ВладельцыЭЦП.
		
		ЗаписьXMLЭлемент(ЗаписьXML, "ИННПартнера", ДокументыПартнерИНН);
		Если Не ДокументыПартнерЭтоИП Тогда
			ЗаписьXMLЭлемент(ЗаписьXML, "КПППартнера", ДокументыПартнерКПП);
		КонецЕсли;
		
		ЗаписьXMLЭлемент(ЗаписьXML, "БилетПользователя", Билет);
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента Заявление.
	
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции

&НаСервере
Функция ТекстФайлаЗапросаНаСертификат()
	
	ТекстОшибки =
		НСтр("ru = 'Не удалось прочитать ранее созданный запрос на сертификат.
		           |Заявление не может быть отправлено.
		           |Удалите его и создайте новое.'");
	
	Если Не ЗначениеЗаполнено(АдресЗапросаНаСертификат) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресЗапросаНаСертификат);
	Если ТипЗнч(ДвоичныеДанныеФайла) <> Тип("ДвоичныеДанные") Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".p10");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
	Текст = СокрЛП(ТекстовыйДокумент.ПолучитьТекст());
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ОписаниеПакетаXML(ИмяФайлаЗаявления)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("пакет");
	ЗаписьXML.ЗаписатьАтрибут("версияФормата", "1С:1.0");
	
	ЗаписьXML.ЗаписатьАтрибут("версПрог", "1.0");
	ЗаписьXML.ЗаписатьАтрибут("типДокументооборота", "РегистрацияАбонентаЭДО");
	ЗаписьXML.ЗаписатьАтрибут("типТранзакции", "Регистрация");
	ЗаписьXML.ЗаписатьАтрибут("идентификаторДокументооборота", ИдентификаторДокументооборота);
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("отправитель");
		ЗаписьXML.ЗаписатьАтрибут("типСубъекта", "абонент");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("получатель");
		ЗаписьXML.ЗаписатьАтрибут("идентификаторСубъекта", "КалугаАстрал");
		ЗаписьXML.ЗаписатьАтрибут("типСубъекта", "спецоператор");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("документ");
		ЗаписьXML.ЗаписатьАтрибут("идентификаторДокумента", НовыйСжатыйУникальныйИдентификатор());
		ЗаписьXML.ЗаписатьАтрибут("типДокумента", "Заявление");
		ЗаписьXML.ЗаписатьАтрибут("типСодержимого", "xml");
		ЗаписьXML.ЗаписатьАтрибут("сжат", "false");
		ЗаписьXML.ЗаписатьАтрибут("зашифрован", "false");
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("содержимое");
			ЗаписьXML.ЗаписатьАтрибут("имяФайла", ИмяФайлаЗаявления);
			ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента документ.
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // КонецЭлемента пакет.
	
	СтрокаXML = ЗаписьXML.Закрыть();
	
	Возврат СтрокаXML;
	
КонецФункции

&НаСервере
Функция ПакетЗаявления(ЗаявлениеXML)
	
	// Подготовка пакета заявления.
	ВременныйКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		КаталогВременныхФайлов() + НовыйСжатыйУникальныйИдентификатор());
	
	СоздатьКаталог(ВременныйКаталог);
	
	ИмяФайлаЗаявления = ВременныйКаталог + НовыйСжатыйУникальныйИдентификатор() + ".bin";
	ИмяФайлаОписания  = ВременныйКаталог + "packageDescription.xml";
	ИмяФайлаПакета    = ВременныйКаталог + ИдентификаторДокументооборота + ".zip";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайлаЗаявления, "windows-1251");
	ЗаписьXML.ЗаписатьБезОбработки(ЗаявлениеXML);
	ЗаписьXML.Закрыть();
	
	ДанныеЗаявления = Новый ДвоичныеДанные(ИмяФайлаЗаявления);
	УдалитьФайлы(ИмяФайлаЗаявления);
	ДанныеЗаявления.Записать(ИмяФайлаЗаявления);
	
	ФайлЗаявления = Новый Файл(ИмяФайлаЗаявления);
	ОписаниеПакетаXML = ОписаниеПакетаXML(ФайлЗаявления.Имя);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайлаОписания, "windows-1251");
	ЗаписьXML.ЗаписатьБезОбработки(ОписаниеПакетаXML);
	ЗаписьXML.Закрыть();
	
	ЗаписьАрхива = Новый ЗаписьZipФайла(ИмяФайлаПакета, , , , УровеньСжатияZIP.Максимальный);
	ЗаписьАрхива.Добавить(ИмяФайлаОписания);
	ЗаписьАрхива.Добавить(ИмяФайлаЗаявления);
	ЗаписьАрхива.Записать();
	
	ПакетЗаявления = Base64Строка(Новый ДвоичныеДанные(ИмяФайлаПакета));
	УдалитьФайлы(ВременныйКаталог);
	
	Возврат ПакетЗаявления;
	
КонецФункции

&НаСервере
Процедура ЗаписьXMLЭлемент(ЗаписьXML, ИмяЭлемента, Значение = Неопределено)
	
	Если Значение = Неопределено Тогда
		Значение = ЭтотОбъект[ИмяЭлемента];
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Значение));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьXMLАдрес(ЗаписьXML, ИмяЭлемента, АдресXML)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	
	АдресСтруктура = МодульУправлениеКонтактнойИнформацией.ПредыдущаяСтруктураКонтактнойИнформацииXML(АдресXML);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	
	ЗаписьXML.ЗаписатьАтрибут("КодРегион",  АдресСтруктура.КодРегиона);
	ЗаписьXML.ЗаписатьАтрибут("НаселПункт", НаселенныйПунктПолностью(АдресСтруктура));
	ЗаписьXML.ЗаписатьАтрибут("Улица",      АдресСтруктура.Улица);
	ЗаписьXML.ЗаписатьАтрибут("Дом",        АдресСтруктура.Дом);
	ЗаписьXML.ЗаписатьАтрибут("Корпус",     АдресСтруктура.Корпус);
	ЗаписьXML.ЗаписатьАтрибут("Кварт",      АдресСтруктура.Квартира);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

&НаСервере
Функция ВебСервисУЦ()
	
	ВебСервис = ОбщегоНазначения.WSПрокси("http://regservice.1c.ru/regservice/regservice.asmx?wsdl",
		"http://regservice.keydisk.ru/", "RegService", "RegServiceSoap", , , 5, Ложь);
	
	Возврат ВебСервис;
	
КонецФункции


&НаСервере
Функция ПолучитьСертификат()
	
	ШаблонОписанияОшибки =
		НСтр("ru = 'Не удалось обновить состояние по причине:
		           |%1'");
	
	// Запрос состояния обработки заявления.
	
	Попытка
		ВебСервис = ВебСервисУЦ();
		Ответ = ВебСервис.ReceivePacket(Строка(ИдентификаторДокументооборота));
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ДатаОбновленияСостояния = ТекущаяДатаСеанса();
		СостояниеОбработкиЗаявления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОписанияОшибки, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат Неопределено;
	КонецПопытки;
	
	ДатаОбновленияСостояния = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(Ответ) Тогда
		СостояниеОбработкиЗаявления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОписанияОшибки, НСтр("ru = 'Сервер вернул пустой ответ.'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Ответ);
	ПостроительDOM = Новый ПостроительDOM();
	ПостроительDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("code");
	КодРезультата = УзелDOM[0].ТекстовоеСодержимое;
	
	ИмяФайлаПакетОтвета = "";
	Если КодРезультата = "0" Тогда
		УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("packet");
		
		Если УзелDOM.Количество() > 0 Тогда
			ДвоичныеДанные = Base64Значение(УзелDOM[0].ТекстовоеСодержимое);
			ИмяФайлаПакетОтвета = ПолучитьИмяВременногоФайла(".zip");
			ДвоичныеДанные.Записать(ИмяФайлаПакетОтвета);
		Иначе
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияОшибки,
				НСтр("ru = 'Сервер вернул пустые данные.'"));
		КонецЕсли;
		
	ИначеЕсли КодРезультата = "1" Тогда
		ОписаниеОшибки = НСтр("ru = 'Заявление еще не обработано, попробуйте позже.'");
	Иначе
		УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("errorMessage");
		Если УзелDOM.Количество() > 0 Тогда
			ОписаниеОшибки = УзелDOM[0].ТекстовоеСодержимое;
		Иначе
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сервер вернул код ошибки: %1'"), Строка(КодРезультата));
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		СостояниеОбработкиЗаявления = ОписаниеОшибки;
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		КаталогВременныхФайлов() + НовыйСжатыйУникальныйИдентификатор());
	
	СоздатьКаталог(ВременныйКаталог);
	
	ФайлНайден = Ложь;
	Попытка
		Архив1 = Новый ЧтениеZipФайла(ИмяФайлаПакетОтвета);
		
		Для Счетчик = 0 По Архив1.Элементы.Количество() - 1 Цикл
			
			Если Архив1.Элементы[Счетчик].Расширение = "bin" Тогда
				ФайлНайден = Истина;
				
				Архив1.Извлечь(Архив1.Элементы[Счетчик], ВременныйКаталог);
				Архив2 = Новый ЧтениеZipФайла(ВременныйКаталог + Архив1.Элементы[Счетчик].Имя);
				Архив2.ИзвлечьВсе(ВременныйКаталог);
				
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ВременныйКаталог + "file");
				ПостроительDOM = Новый ПостроительDOM;
				ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);
				ЧтениеXML.Закрыть();
				
				РегистрацияУспешна = Булево(ЗначениеУзлаXML(ДокументDOM, "РегистрацияУспешна"));
				СостояниеОбработкиЗаявления = ЗначениеУзлаXML(ДокументDOM, "Результат");
				
				Если РегистрацияУспешна Тогда
					ИдентификаторАбонента = ЗначениеУзлаXML(ДокументDOM, "ИдентификаторАбонента");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ФайлНайден Тогда
			ВызватьИсключение НСтр("ru = 'Неверный формат данных.'");
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось разобрать ответ сервера по причине:
			           |%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаПакетОтвета);
	УдалитьФайлы(ВременныйКаталог);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		СостояниеОбработкиЗаявления = ОписаниеОшибки;
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не РегистрацияУспешна Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Запрос сертификата.
	
	Ответ = ВебСервис.ReceiveUpdatedPacket(Строка(ИдентификаторАбонента), Дата('00010101'));
	
	ОписаниеОшибки = "";
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Ответ);
	ПостроительDOM = Новый ПостроительDOM();
	ПостроительDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("code");
	КодРезультата = УзелDOM[0].ТекстовоеСодержимое;
	
	ИмяФайлаПакетОтвета = "";
	Если КодРезультата = "0" Тогда
		УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("packet");
		
		Если УзелDOM.Количество() > 0 Тогда
			ДвоичныеДанные = Base64Значение(УзелDOM[0].ТекстовоеСодержимое);
			ИмяФайлаПакетОтвета = ПолучитьИмяВременногоФайла(".zip");
			ДвоичныеДанные.Записать(ИмяФайлаПакетОтвета);
		Иначе
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияОшибки,
				НСтр("ru = 'Сервер вернул пустые данные.'"));
		КонецЕсли;
	Иначе
		УзелDOM = ПостроительDOM.ПолучитьЭлементыПоИмени("errorMessage");
		Если УзелDOM.Количество() > 0 Тогда
			ОписаниеОшибки = УзелDOM[0].ТекстовоеСодержимое;
		Иначе
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Сервер вернул код ошибки: %1'"), Строка(КодРезультата));
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		СостояниеОбработкиЗаявления = ОписаниеОшибки;
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		КаталогВременныхФайлов() + НовыйСжатыйУникальныйИдентификатор());
	
	СоздатьКаталог(ВременныйКаталог);
	
	ФайлНайден = Ложь;
	
	Попытка
		Архив = Новый ЧтениеZipФайла(ИмяФайлаПакетОтвета);
		
		Для Счетчик = 0 По Архив.Элементы.Количество() - 1 Цикл
			
			Если Архив.Элементы[Счетчик].Расширение = "xml" Тогда
				ФайлНайден = Истина;
				
				Архив.Извлечь(Архив1.Элементы[Счетчик], ВременныйКаталог);
				
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(ВременныйКаталог + Архив1.Элементы[Счетчик].Имя); 
				ПостроительDOM = Новый ПостроительDOM;
				ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
				ЧтениеXML.Закрыть();
				
				УзелDOM = ДокументDOM.ПолучитьЭлементыПоИмени("Сертификат");
				Если УзелDOM.Количество() <> 2 Тогда
					ВызватьИсключение НСтр("ru = 'Неверный формат данных.'");
				КонецЕсли;
				
				СертификатСтрокой = "";
				КорневойСертификатСтрокой = "";
				
				Для Каждого Узел Из УзелDOM Цикл
					Отпечаток = Узел.Атрибуты.ПолучитьИменованныйЭлемент("Отпечаток").ТекстовоеСодержимое;
					Хранилище = Узел.Атрибуты.ПолучитьИменованныйЭлемент("Хранилище").ТекстовоеСодержимое;
					Если Хранилище = "MY" Тогда
						СертификатСтрокой = Узел.ТекстовоеСодержимое;
						СертификатОтпечатокСтрокаДанных = Отпечаток;
					КонецЕсли;
					Если Хранилище = "ROOT" Тогда
						КорневойСертификатСтрокой = Узел.ТекстовоеСодержимое;
						КорневойСертификатОтпечатокСтрокаДанных = Отпечаток;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(СертификатСтрокой)
				 Или Не ЗначениеЗаполнено(КорневойСертификатСтрокой)
				 Или СтрДлина(СертификатОтпечатокСтрокаДанных) <> 40
				 Или СтрДлина(КорневойСертификатОтпечатокСтрокаДанных) <> 40 Тогда
					
					ВызватьИсключение НСтр("ru = 'Неверный формат данных.'");
				КонецЕсли;
				
				ДанныеСертификата          = ДанныеСертификатаИзСтроки(СертификатСтрокой);
				ДанныеКорневогоСертификата = ДанныеСертификатаИзСтроки(КорневойСертификатСтрокой);
				
				ДанныеОтпечаткаСертификата          = ДанныеОтпечаткаИзСтроки(СертификатОтпечатокСтрокаДанных);
				ДанныеОтпечаткаКорневогоСертификата = ДанныеОтпечаткаИзСтроки(КорневойСертификатОтпечатокСтрокаДанных);
			КонецЕсли;
		КонецЦикла;
		
		Если Не ФайлНайден Тогда
			ВызватьИсключение НСтр("ru = 'Неверный формат данных.'");
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось разобрать ответ сервера по причине:
			           |%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаПакетОтвета);
	УдалитьФайлы(ВременныйКаталог);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		СостояниеОбработкиЗаявления = ОписаниеОшибки;
		Возврат Неопределено;
	КонецЕсли;
	
	АдресСертификата = ПоместитьВоВременноеХранилище(ДанныеСертификата, УникальныйИдентификатор);
	ОтпечатокСертификата = Base64Строка(ДанныеОтпечаткаСертификата);
	// Установка отпечатка, чтобы не было возможности добавить дубль сертификата.
	Объект.Отпечаток = ОтпечатокСертификата;
	
	АдресКорневогоСертификата = ПоместитьВоВременноеХранилище(ДанныеКорневогоСертификата, УникальныйИдентификатор);
	ОтпечатокКорневогоСертификата = Base64Строка(ДанныеОтпечаткаКорневогоСертификата);
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеУзлаXML(ДокументDOM, НазваниеУзла, ЗначениеПоУмолчанию = "")
	
	УзелDOM = ДокументDOM.ПолучитьЭлементыПоИмени(НазваниеУзла);
	
	ПодходящийЭлементDOM = Неопределено;
	
	Если УзелDOM.Количество() > 0 Тогда
		ПодходящийЭлементDOM = УзелDOM[0];
	КонецЕсли;
	
	Если ПодходящийЭлементDOM = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
		
	ИначеЕсли НазваниеУзла = "Отпечаток" Тогда
		Возврат НРег(ПодходящийЭлементDOM.ТекстовоеСодержимое);
	Иначе
		Возврат ПодходящийЭлементDOM.ТекстовоеСодержимое;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьСертификат(ОбработкаПродолжения)
	
	ДатаУстановкиСертификата = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	ОшибкаНаКлиенте = Новый Структура;
	Менеджер = ЭлектроннаяПодписьСлужебныйКлиент.МенеджерКриптографии("", Ложь, ОшибкаНаКлиенте);
	
	Если Менеджер = Неопределено Тогда
		ЭлектроннаяПодписьСлужебныйКлиент.ПоказатьОшибкуОбращенияКПрограмме(
			НСтр("ru = 'Установка сертификата на компьютер'"),, ОшибкаНаКлиенте, Новый Структура);
		
		ОшибкаУстановкиСертификата = ОшибкаНаКлиенте.ОписаниеОшибки;
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбработкаПродолжения", ОбработкаПродолжения);
	ДополнительныеПараметры.Вставить("МенеджерКриптографии", Менеджер);
	
	Если Криптография <> Неопределено Тогда
		УстановитьСертификатПослеСозданияОбъектаКриптографии(Истина, ДополнительныеПараметры);
	Иначе
		СоздатьОбъектКриптографии(Новый ОписаниеОповещения(
			"УстановитьСертификатПослеСозданияОбъектаКриптографии", ЭтотОбъект, ДополнительныеПараметры),
			НСтр("ru = 'Для установки сертификата на компьютер требуется
			           |установить расширение для веб-клиента 1С:Предприятия.'"),
			НСтр("ru = 'Для установки сертификата на компьютер требуется
			           |установить дополнительную внешнюю компоненту.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСертификатПослеСозданияОбъектаКриптографии(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработкаПродолжения = ДополнительныеПараметры.ОбработкаПродолжения;
	
	Если Результат <> Истина Тогда
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
			ОшибкаУстановкиСертификата = НСтр("ru = 'Не установлено расширение для работы с файлами.'");
			
		ИначеЕсли Не ПодключитьРасширениеРаботыСКриптографией() Тогда
			ОшибкаУстановкиСертификата = НСтр("ru = 'Не установлено расширение для работы с криптографией.'");
		Иначе
			ОшибкаУстановкиСертификата = НСтр("ru = 'Не установлена дополнительная внешняя компонента.'");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ВременныйКаталог = КаталогВременныхФайловКомпоненты() + "certificates";
	
	Счетчик = 0;
	Пока Истина Цикл
		Добавка = СокрЛП(Формат(Счетчик, "ЧН=' '; ЧГ="));
		Файл = Новый Файл(ВременныйКаталог + Добавка);
		Если Файл.Существует() Тогда
			Счетчик = Счетчик + 1;
		Иначе
			ВременныйКаталог = ВременныйКаталог + Добавка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВременныйКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВременныйКаталог);
	
	ИмяФайлаСертификата          = "my.cer";
	ИмяФайлаКорневогоСертификата = "root.cer";
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайлаСертификата, АдресСертификата));
	ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайлаКорневогоСертификата, АдресКорневогоСертификата));
	
	Вызовы = Новый Массив;
	ДобавитьВызов(Вызовы, "ПолучитьФайлы", ПолучаемыеФайлы, , Файл.ПолноеИмя, Ложь,);
	ДобавитьВызов(Вызовы, "УдалитьФайлы", Файл.ПолноеИмя, , , ,);
	
	Если Не ЗапроситьРазрешениеПользователя(Вызовы) Тогда
		ОшибкаУстановкиСертификата = НСтр("ru = 'Пользователь отказался от сохранения сертификатов во временную папку.'");
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	СоздатьКаталог(Файл.ПолноеИмя);
	
	Если Не ПолучитьФайлы(ПолучаемыеФайлы, , Файл.ПолноеИмя, Ложь) Тогда
		УдалитьФайлы(Файл.ПолноеИмя);
		ОшибкаУстановкиСертификата = НСтр("ru = 'Сертификаты не были сохранены во временную папку.'");
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	Если Не КонтейнерКлючейСуществует(КонтейнерКлючаПуть, КонтейнерКлючаИмя) Тогда
		ОшибкаУстановкиСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось найти контейнер ключа на компьютере.
			           |Имя контейнера: ""%1"".
			           |Путь к контейнеру: ""%2"".'"),
			КонтейнерКлючаИмя,
			КонтейнерКлючаПуть);
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	АктивноеОкно().Активизировать();
	
	ОшибкаУстановкиСертификата = "";
	Результат = Ложь;
	Попытка
		Результат = Криптография.УстановитьСертификатВКонтейнерИХранилище(ВременныйКаталог + ИмяФайлаСертификата, КонтейнерКлючаПуть);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОшибкаУстановкиСертификата = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	АктивноеОкно().Активизировать();
	
	Если Результат <> Истина Тогда
		Если Не ЗначениеЗаполнено(ОшибкаУстановкиСертификата) Тогда
			ОшибкаУстановкиСертификата = НСтр("ru = 'Не удалось установить личный сертификат.'");
		КонецЕсли;
		УдалитьФайлы(Файл.ПолноеИмя);
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	СертификатКриптографии = ЭлектроннаяПодписьСлужебныйКлиентСервер.ПолучитьСертификатПоОтпечатку(
		ДополнительныеПараметры.МенеджерКриптографии, ОтпечатокСертификата,
		ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты, Ложь, ОписаниеОшибки);
	
	Если СертификатКриптографии = Неопределено Тогда
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОшибкаУстановкиСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось найти личный сертификат, установленный на компьютер по причине:
				           |%1'"),
				ОписаниеОшибки);
		Иначе
			ОшибкаУстановкиСертификата =
				НСтр("ru = 'Не удалось найти личный сертификат, установленный на компьютер.'");
		КонецЕсли;
		УдалитьФайлы(Файл.ПолноеИмя);
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	АктивноеОкно().Активизировать();
	
	Результат = Ложь;
	Попытка
		Результат = Криптография.ИмпортироватьСертификат(ВременныйКаталог + ИмяФайлаКорневогоСертификата, "ROOT");
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОшибкаУстановкиСертификата = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Если Результат <> Истина И Не ЗначениеЗаполнено(ОшибкаУстановкиСертификата) Тогда
		ОшибкаУстановкиСертификата = НСтр("ru = 'Не удалось установить корневой сертификат.'");
	КонецЕсли;
	
	АктивноеОкно().Активизировать();
	
	ОписаниеОшибки = "";
	КорневойСертификатКриптографии = ЭлектроннаяПодписьСлужебныйКлиентСервер.ПолучитьСертификатПоОтпечатку(
		ДополнительныеПараметры.МенеджерКриптографии, ОтпечатокКорневогоСертификата,
		ТипХранилищаСертификатовКриптографии.КорневыеСертификаты, Ложь, ОписаниеОшибки);
	
	Если КорневойСертификатКриптографии = Неопределено Тогда
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОшибкаУстановкиСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось найти корневой сертификат, установленный на компьютер по причине:
				           |%1'"),
				ОписаниеОшибки);
		Иначе
			ОшибкаУстановкиСертификата =
				НСтр("ru = 'Не удалось найти корневой сертификат, установленный на компьютер.'");
		КонецЕсли;
		УдалитьФайлы(Файл.ПолноеИмя);
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	УдалитьФайлы(Файл.ПолноеИмя);
	
	АдресСертификатаКриптографии = ПоместитьВоВременноеХранилище(СертификатКриптографии.Выгрузить(),
		УникальныйИдентификатор);
	
	ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Не ЗначениеЗаполнено(ОшибкаУстановкиСертификата));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВызов(Вызовы, Метод, П1, П2, П3, П4, П5)
	
	Вызов = Новый Массив;
	Вызов.Добавить(Метод);
	Вызов.Добавить(П1);
	Вызов.Добавить(П2);
	Вызов.Добавить(П3);
	Вызов.Добавить(П4);
	Вызов.Добавить(П5);
	
	Вызовы.Добавить(Вызов);
	
КонецПроцедуры

// Обработка ввода адреса через подсистему КонтактнаяИнформация.

&НаКлиенте
Процедура ПредставлениеАдресаНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяРеквизита, ЗаголовокФормы)
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
		"УправлениеКонтактнойИнформациейКлиент");
	
	ИмяТипаКонтактнойИнформации = "Перечисление" + ".ТипыКонтактнойИнформации.Адрес";
	
	ВидКонтактнойИнформации = Новый Структура;
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение(ИмяТипаКонтактнойИнформации));
	ВидКонтактнойИнформации.Вставить("АдресТолькоРоссийский",        Истина);
	ВидКонтактнойИнформации.Вставить("ВключатьСтрануВПредставление", Ложь);
	ВидКонтактнойИнформации.Вставить("СкрыватьНеактуальныеАдреса",   Ложь);
	
	ПараметрыФормы = МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформации, ЭтотОбъект[ИмяРеквизита + "XML"], ЭтотОбъект[ИмяРеквизита]);
	
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаОчистка(Форма, Элемент, СтандартнаяОбработка, ИмяРеквизита)
	
	Форма[ИмяРеквизита + "XML"] = "";
	Форма[ИмяРеквизита] = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяРеквизита)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		// Данные не изменены.
		Возврат;
	КонецЕсли;
	
	Форма[ИмяРеквизита + "XML"] = ВыбранноеЗначение.КонтактнаяИнформация;
	Форма[ИмяРеквизита] = ВыбранноеЗначение.Представление;
	
	ПроверитьАдрес(ИмяРеквизита);
	
КонецПроцедуры

// Обработка ввода телефона через подсистему КонтактнаяИнформация.

&НаКлиенте
Процедура ПредставлениеТелефонаНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяРеквизита, ЗаголовокФормы)
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
		"УправлениеКонтактнойИнформациейКлиент");
	
	ИмяТипаКонтактнойИнформации = "Перечисление" + ".ТипыКонтактнойИнформации.Телефон";
	
	ВидКонтактнойИнформации = Новый Структура;
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение(ИмяТипаКонтактнойИнформации));
	
	ПараметрыФормы = МодульУправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформации, ЭтотОбъект[ИмяРеквизита + "XML"], ЭтотОбъект[ИмяРеквизита]);
	
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
	
	МодульУправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТелефонаОчистка(Форма, Элемент, СтандартнаяОбработка, ИмяРеквизита)
	
	Форма[ИмяРеквизита + "XML"] = "";
	Форма[ИмяРеквизита] = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТелефонаОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяРеквизита)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		// Данные не изменены.
		Возврат;
	КонецЕсли;
	
	Форма[ИмяРеквизита + "XML"] = ВыбранноеЗначение.КонтактнаяИнформация;
	Форма[ИмяРеквизита] = ВыбранноеЗначение.Представление;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ИмяРегионаРФПоРекомендациямДляСКПЭП(КодРегиона)
	
	// Методические рекомендации по составу квалифицированного сертификата ключа
	// проверки электронной подписи (Версия 1.4).
	//
	// Приложение 2. Формат названия субъекта федерации.
	// Из раздела "Справочник кодов регионов".
	
	ИменаВсехРегионовРФ = Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПолучитьМакет(
		"ИменаРегионовРФПоРекомендациямДляСКПЭП");
	
	Строка = ИменаВсехРегионовРФ.ПолучитьСтроку(Число(КодРегиона));
	
	Если Лев(Строка, 3) <> КодРегиона + " " Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Регион РФ с кодом ""%1"" не существует.'"), КодРегиона);
	КонецЕсли;
	
	Строка = СокрЛП(Сред(Строка, 4));
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для региона РФ с кодом ""%1"" имя, рекомендованное для СКПЭП, еще не назначено.'"),
			КодРегиона);
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоставляемоеПредставлениеПрограммы(СписокПрограмм, Программа)
	
	Если ТипЗнч(Программа) = Тип("Строка") Тогда
		Строки = СписокПрограмм.НайтиСтроки(Новый Структура("Идентификатор", Программа));
	Иначе
		Строки = СписокПрограмм.НайтиСтроки(Новый Структура("Ссылка", Программа));
	КонецЕсли;
	
	Возврат Строки[0].Представление;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьЗаявление()
	
	ЗаблокироватьДанныеДляРедактирования(Параметры.СертификатСсылка, , УникальныйИдентификатор);
	ТекущийОбъект = Параметры.СертификатСсылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	ПоследнееСостояниеЗаявления = Объект.СостояниеЗаявления;
	
	Содержание = ТекущийОбъект.СодержаниеЗаявления.Получить();
	Если ТипЗнч(Содержание) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Содержание);
	КонецЕсли;
	
	Если Содержание.Свойство("ЗапросНаСертификат")
	   И ТипЗнч(Содержание.ЗапросНаСертификат) = Тип("ДвоичныеДанные") Тогда
		
		АдресЗапросаНаСертификат = ПоместитьВоВременноеХранилище(Содержание.ЗапросНаСертификат, УникальныйИдентификатор);
	КонецЕсли;
	
	Если Содержание.Свойство("Сертификат")
	   И ТипЗнч(Содержание.Сертификат) = Тип("ДвоичныеДанные") Тогда
		
		АдресСертификата = ПоместитьВоВременноеХранилище(Содержание.Сертификат, УникальныйИдентификатор);
	КонецЕсли;

	Если Содержание.Свойство("КорневойСертификат")
	   И ТипЗнч(Содержание.КорневойСертификат) = Тип("ДвоичныеДанные") Тогда
		
		АдресКорневогоСертификата = ПоместитьВоВременноеХранилище(Содержание.КорневойСертификат, УникальныйИдентификатор);
	КонецЕсли;
	
	ПодтверждениеСоглашения = Истина;
	Элементы.ПодтверждениеСоглашения.ТолькоПросмотр = Истина;
	Элементы.ФормаНапечататьСоглашение.Видимость = Ложь;
	Элементы.ФормаДалее.Доступность = Истина;
	
	Если ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.НеПодготовлено Тогда
		ПерейтиНаСтраницуПодготовкаЗапросаНаСертификатНаСервереПриЗагрузке();
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Подготовлено Тогда
		ПерейтиНаСтраницуОтправкаЗаявленияНаСервереПриЗагрузке();
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Отправлено Тогда
		ПерейтиНаСтраницуОжиданиеОбработкиЗаявленияНаСервереПриЗагрузке();
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.ИсполненоСертификатНеУстановлен Тогда
		ПерейтиНаСтраницуУстановкаСертификатаНаСервереПриЗагрузке();
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Отклонено Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заявление, по которому не удалось получить сертификат'");
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
		ЗаполнитьРеквизитыЗаявления(Истина);
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработанноеЗаявление;
		Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаОбработанноеЗаявление;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Исполнено Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заявление, по которому был получен сертификат'");
		Элементы.ФормаВыгрузитьЗапросНаСертификат.Видимость = Истина;
		Элементы.ФормаДалее.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Заголовок = НСтр("ru = 'Закрыть'");
		ЗаполнитьРеквизитыЗаявления(Истина);
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбработанноеЗаявление;
		Элементы.СтраницыПрогресса.ТекущаяСтраница = Элементы.СтраницаПрогрессаОбработанноеЗаявление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеСертификатаИзСтроки(Строка64)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("cer");
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, "windows-1251");
	ЗаписьТекста.ЗаписатьСтроку("-----BEGIN CERTIFICATE-----");
	ЗаписьТекста.ЗаписатьСтроку(Строка64);
	ЗаписьТекста.ЗаписатьСтроку("-----END CERTIFICATE-----");
	ЗаписьТекста.Закрыть();
	
	Данные = Новый ДвоичныеДанные(ИмяФайла);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Функция ДанныеОтпечаткаИзСтроки(ДанныеСтрокой)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("bin");
	
	Base64Значение(
		  "AAECAwQFBgcICQoLDA0ODxAREhMUFRYXGBkaGxwdHh8gISIjJCUmJygpKissLS4v"
		+ "MDEyMzQ1Njc4OTo7PD0+P0BBQkNERUZHSElKS0xNTk9QUVJTVFVWV1hZWltcXV5f"
		+ "YGFiY2RlZmdoaWprbG1ub3BxcnN0dXZ3eHl6e3x9fn+AgYKDhIWGh4iJiouMjY6P"
		+ "kJGSk5SVlpeYmZqbnJ2en6ChoqOkpaanqKmqq6ytrq+wsbKztLW2t7i5uru8vb6/"
		+ "wMHCw8TFxsfIycrLzM3Oz9DR0tPU1dbX2Nna29zd3t/g4eLj5OXm5+jp6uvs7e7v"
		+ "8PHy8/T19vf4+fr7/P3+/w==").Записать(ИмяФайла);
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.OEM, Символы.ПС, Символы.ПС);
	ОбразцыСимволов = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	УдалитьФайлы(ИмяФайла);
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.OEM, Символы.ПС, , Символы.ПС);
	
	ОстатокСтроки = ДанныеСтрокой;
	Пока ЗначениеЗаполнено(ОстатокСтроки) Цикл
		ТекущаяСтрока = Лев(ОстатокСтроки, 2);
		ОстатокСтроки = Сред(ОстатокСтроки, 3);
		
		Число = ЧислоИзШестнадцатеричногоСимвола(Сред(ТекущаяСтрока, 1, 1))*16
		      + ЧислоИзШестнадцатеричногоСимвола(Сред(ТекущаяСтрока, 2, 1));
		
		ЗаписьТекста.Записать(Сред(ОбразцыСимволов, Число + 1, 1));
	КонецЦикла;
	
	ЗаписьТекста.Закрыть();
	
	Данные = Новый ДвоичныеДанные(ИмяФайла);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Функция ЧислоИзШестнадцатеричногоСимвола(ИсходныйСимвол)
	
	Символ = ВРег(ИсходныйСимвол);
	
	Если Символ >= "0" И Символ <= "9" Тогда
		Возврат КодСимвола(Символ) - КодСимвола("0");
		
	ИначеЕсли Символ >= "A" И Символ <= "F" Тогда
		
		Возврат 10 + КодСимвола(Символ) - КодСимвола("A");
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Ошибка преобразования шестнадцатеричного символа в число.'");
	
КонецФункции


&НаСервере
Процедура ЗаполнитьРеквизитыЗаявления(Все = Ложь)
	
	РеквизитыЗаявления.Очистить();
	
	// Заполнение сведений о программе.
	Если Все Тогда
		Строка = РеквизитыЗаявления.Добавить();
		Строка.Реквизит = НСтр("ru = 'Программа электронной подписи'");
		Строка.Значение = ПредставлениеПрограммы;
	КонецЕсли;
	
	// Заполнение сведений об организации.
	ЗаполнитьРеквизит(НСтр("ru = 'Сведения об организации'"),, Истина);
	
	ЗаполнитьРеквизит("НаименованиеСокращенное");
	ЗаполнитьРеквизит("НаименованиеПолное");
	ЗаполнитьРеквизит("ИНН");
	
	Если Не ЭтоИндивидуальныйПредприниматель Тогда
		ЗаполнитьРеквизит("КПП");
	КонецЕсли;
	
	ЗаполнитьРеквизит("ОГРН");
	ЗаполнитьРеквизит("РасчетныйСчет");
	ЗаполнитьРеквизит("БИК");
	ЗаполнитьРеквизит("КорреспондентскийСчет");
	ЗаполнитьРеквизит("Телефон", Телефон);
	ЗаполнитьРеквизит("ЮридическийАдрес", ЮридическийАдрес);
	ЗаполнитьРеквизит("ФактическийАдрес", ФактическийАдрес);
	
	// Заполнение сведений о владельце сертификата.
	ЗаполнитьРеквизит(НСтр("ru = 'Сведения о владельце сертификата'"),, Истина);
	
	ЗаполнитьРеквизит("Фамилия");
	ЗаполнитьРеквизит("Имя");
	ЗаполнитьРеквизит("Отчество");
	ЗаполнитьРеквизит("СтраховойНомерПФР", ПредставлениеРеквизитаСтраховойНомерПФР(СтраховойНомерПФР));
	
	Если Не ЭтоИндивидуальныйПредприниматель Тогда
		ЗаполнитьРеквизит("Должность");
		ЗаполнитьРеквизит("Подразделение");
	КонецЕсли;
	
	Строка = РеквизитыЗаявления.Добавить();
	Строка.Реквизит = НСтр("ru = 'Документ, удостоверяющий личность'");
	Строка.Значение = Элементы.ДокументВид.СписокВыбора.НайтиПоЗначению(ДокументВид).Представление;
	
	Строка = РеквизитыЗаявления.Добавить();
	Если ДокументВид = "21" Тогда
		Строка.Реквизит = НСтр("ru = 'Серия и номер'");
		Строка.Значение = ПредставлениеРеквизитаНомерПаспортаРФ(ДокументНомер);
	Иначе
		Строка.Реквизит = НСтр("ru = 'Номер'");
		Строка.Значение = ДокументНомер;
	КонецЕсли;
	
	ЗаполнитьРеквизит("ДокументКемВыдан");
	ЗаполнитьРеквизит("ДокументДатаВыдачи", ПредставлениеРеквизитаДокументДатаВыдачи(ДокументДатаВыдачи));
	
	ЗаполнитьРеквизит("ЭлектроннаяПочта");
	
	Если Не Все Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоИндивидуальныйПредприниматель Тогда
		// Заполнение сведений о печатных документах.
		ЗаполнитьРеквизит(НСтр("ru = 'Сведения о руководителе'"),, Истина);
		
		Строка = РеквизитыЗаявления.Добавить();
		Строка.Реквизит = НСтр("ru = 'ФИО руководителя'");
		Строка.Значение = ДокументыРуководитель;
		
		Строка = РеквизитыЗаявления.Добавить();
		Строка.Реквизит = НСтр("ru = 'Должность руководителя'");
		Строка.Значение = ДокументыРуководительДолжность;
		
		Строка = РеквизитыЗаявления.Добавить();
		Строка.Реквизит = НСтр("ru = 'Основание действий руководителя'");
		Строка.Значение = ДокументыРуководительОснование;
	КонецЕсли;
	
	// Заполнение сведений о печатных документах.
	ЗаполнитьРеквизит(НСтр("ru = 'Сведения об обслуживающей организации'"),, Истина);
	
	Строка = РеквизитыЗаявления.Добавить();
	Строка.Реквизит = НСтр("ru = 'Наименование партнера'");
	Строка.Значение = ДокументыПартнер;
	
	Строка = РеквизитыЗаявления.Добавить();
	Строка.Реквизит = НСтр("ru = 'ИНН партнера'");
	Строка.Значение = ДокументыПартнерИНН;
	
	Если Не ДокументыПартнерЭтоИП Тогда
		Строка = РеквизитыЗаявления.Добавить();
		Строка.Реквизит = НСтр("ru = 'КПП партнера'");
		Строка.Значение = ДокументыПартнерКПП;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеРеквизитаСтраховойНомерПФР(СтраховойНомерПФР)
	
	Возврат Сред(СтраховойНомерПФР, 1, 3) + "-" + Сред(СтраховойНомерПФР,  4, 3)
	+ "-" + Сред(СтраховойНомерПФР, 7, 3) + " " + Сред(СтраховойНомерПФР, 10, 2);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеРеквизитаДокументДатаВыдачи(ДокументДатаВыдачи)
	
	Возврат Формат(ДокументДатаВыдачи, "ДФ=dd.MM.yyyy");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеРеквизитаНомерПаспортаРФ(НомерПаспортаРФ)
	
	Возврат Лев(НомерПаспортаРФ, 2) + " " + Сред(НомерПаспортаРФ, 3, 2) + " " + Прав(НомерПаспортаРФ, 6);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизит(ИмяРеквизита, Значение = Неопределено, ЭтоГруппаРеквизитов = Ложь)
	
	Строка = РеквизитыЗаявления.Добавить();
	
	Если ЭтоГруппаРеквизитов Тогда
		Строка.ЭтоГруппаРеквизитов = Истина;
		Строка.Реквизит = ИмяРеквизита;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы[ИмяРеквизита].Заголовок) Тогда
		Строка.Реквизит = Элементы[ИмяРеквизита].Заголовок;
	Иначе
		Строка.Реквизит = ЗаголовкиРеквизитов.НайтиПоЗначению(ИмяРеквизита);
	КонецЕсли;
	
	Если Значение = Неопределено Тогда
		Строка.Значение = ЭтотОбъект[ИмяРеквизита];
	Иначе
		Строка.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыйСжатыйУникальныйИдентификатор()
	
	Возврат НРег(СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", ""));
	
КонецФункции

&НаКлиенте
Процедура ПрограммаОбработкаВыбораПродолжение(Ответ, ИдентификаторПоставляемойНастройки) Экспорт
	
	Если Ответ <> "Добавить" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторПоставляемойНастройки", ИдентификаторПоставляемойНастройки);
	
	ОткрытьФорму("Справочник.ПрограммыЭлектроннойПодписиИШифрования.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РеквизитыЗаявленияРеквизит.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РеквизитыЗаявленияЗначение.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РеквизитыЗаявленияВсеРеквизит.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РеквизитыЗаявленияВсеЗначение.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РеквизитыЗаявления.ЭтоГруппаРеквизитов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(220, 220, 220));
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт",
		Новый Шрифт(Элементы.РеквизитыЗаявленияРеквизит.Шрифт, , , Истина,,,, 80));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоглашение()
	
	ТекстHTML = Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПолучитьМакет(
		"Соглашение").ПолучитьТекст();
	
	ТекстHTML = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстHTML,
		// Наименование удостоверяющего центра.
		НСтр("ru = 'ООО «Научно-производственный центр ""1С""»'"),
		// Адрес регламента удостоверяющего центра.
		НСтр("ru = 'http://ca.1c.ru/reglament.pdf'"),
		// Сеть доверенных удостоверяющих центров.
		НСтр("ru = 'уполномоченного федерального органа в области использования электронной подписи'"));
	
	Соглашение.УстановитьHTML(ТекстHTML, Новый Структура);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиРеквизитов()
	
	Реквизиты = ПолучитьРеквизиты();
	Для каждого Реквизит Из Реквизиты Цикл
		ЗаголовкиРеквизитов.Добавить(Реквизит.Имя, Реквизит.Заголовок);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененияСоставаИлиНастроекПрограмм()
	
	ЗаполнитьСписокПрограмм();
	
	ЗаполнитьПрограмму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПрограмм()
	
	СписокПрограмм.Очистить();
	Настройки = Справочники.ПрограммыЭлектроннойПодписиИШифрования.ПоставляемыеНастройкиПрограмм();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Программы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПрограммыЭлектроннойПодписиИШифрования КАК Программы
	|ГДЕ
	|	Программы.ИмяПрограммы = &ИмяПрограммы
	|	И Программы.ТипПрограммы = &ТипПрограммы";
	
	Для каждого Настройка Из Настройки Цикл
		Если Настройка.Идентификатор = "VipNet"
		 Или Настройка.Идентификатор = "CryptoPro" Тогда
			
			Строка = СписокПрограмм.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Настройка);
			
			Запрос.УстановитьПараметр("ИмяПрограммы", Настройка.ИмяПрограммы);
			Запрос.УстановитьПараметр("ТипПрограммы", Настройка.ТипПрограммы);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Строка.Ссылка = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрограмму()
	
	Если ЗначениеЗаполнено(Объект.Программа) Тогда
		ПослеВыбораПрограммы(Ложь);
		Возврат;
	КонецЕсли;
	
	ПерваяДобавленнаяПрограмма = Неопределено;
	Для каждого Строка Из СписокПрограмм Цикл
		
		Если ПерваяДобавленнаяПрограмма = Неопределено
		   И ЗначениеЗаполнено(Строка.Ссылка) Тогда
			
			ПерваяДобавленнаяПрограмма = Строка.Ссылка;
		КонецЕсли;
		
		Менеджер = ЭлектроннаяПодписьКлиент.МенеджерКриптографии("", Ложь,, Строка.Ссылка);
		Если Менеджер = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.Программа = Строка.Ссылка;
		Возврат;
	КонецЦикла;
	
	Если ПерваяДобавленнаяПрограмма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Программа = ПерваяДобавленнаяПрограмма;
	
	ПослеВыбораПрограммы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПрограммы(ПоказатьОшибку)
	
	Криптография = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.Программа) Тогда
		ОписаниеОшибки = Новый Структура;
		Менеджер = ЭлектроннаяПодписьСлужебныйКлиент.МенеджерКриптографии("",
			Ложь, ОписаниеОшибки, Объект.Программа);
		
		Если Менеджер = Неопределено Тогда
			Объект.Программа = Неопределено;
			
			Если ПоказатьОшибку Тогда
				ЭлектроннаяПодписьСлужебныйКлиент.ПоказатьОшибкуОбращенияКПрограмме(
					НСтр("ru = 'Выбор программы электронной подписи'"),, ОписаниеОшибки, Новый Структура);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьЗаявление()
	
	ЭтоНовоеСостояние = ПоследнееСостояниеЗаявления <> Объект.СостояниеЗаявления;
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Содержание = ТекущийОбъект.СодержаниеЗаявления.Получить();
	Если ТипЗнч(Содержание) <> Тип("Структура") Тогда
		Содержание = Новый Структура;
	КонецЕсли;
	Содержание.Вставить("ЕстьИзменения", ЭтоНовоеСостояние);
	
	Если ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.НеПодготовлено Тогда
		ТекущийОбъект.Наименование = Фамилия + " " + Имя + " " + Отчество + " (" + НСтр("ru = 'Заявление на новый сертификат'") + ")";
		// Организация.
		ОбновитьЗначение(Содержание, "ЭтоИндивидуальныйПредприниматель");
		ОбновитьЗначение(Содержание, "Организация");
		ОбновитьЗначение(Содержание, "НаименованиеСокращенное");
		ОбновитьЗначение(Содержание, "НаименованиеПолное");
		ОбновитьЗначение(Содержание, "ИНН");
		ОбновитьЗначение(Содержание, "КПП");
		ОбновитьЗначение(Содержание, "ОГРН");
		ОбновитьЗначение(Содержание, "РасчетныйСчет");
		ОбновитьЗначение(Содержание, "БИК");
		ОбновитьЗначение(Содержание, "КорреспондентскийСчет");
		ОбновитьЗначение(Содержание, "ЮридическийАдрес");
		ОбновитьЗначение(Содержание, "ЮридическийАдресXML");
		ОбновитьЗначение(Содержание, "ФактическийАдрес");
		ОбновитьЗначение(Содержание, "ФактическийАдресXML");
		ОбновитьЗначение(Содержание, "Телефон");
		ОбновитьЗначение(Содержание, "ТелефонXML");
		// Владелец.
		ОбновитьЗначение(Содержание, "ВидВладельца");
		ОбновитьЗначение(Содержание, "Директор");
		ОбновитьЗначение(Содержание, "ГлавныйБухгалтер");
		ОбновитьЗначение(Содержание, "Сотрудник");
		ОбновитьЗначение(Содержание, "Фамилия");
		ОбновитьЗначение(Содержание, "Имя");
		ОбновитьЗначение(Содержание, "Отчество");
		ОбновитьЗначение(Содержание, "СтраховойНомерПФР");
		ОбновитьЗначение(Содержание, "Должность");
		ОбновитьЗначение(Содержание, "ДокументВид");
		ОбновитьЗначение(Содержание, "ДокументНомер");
		ОбновитьЗначение(Содержание, "ДокументКемВыдан");
		ОбновитьЗначение(Содержание, "ДокументДатаВыдачи");
		ОбновитьЗначение(Содержание, "ЭлектроннаяПочта");
		ОбновитьЗначение(Содержание, "Подразделение");
		// Сохранение заполненных значений, если есть.
		ОбновитьЗначение(Содержание, "Программа", Объект.Программа);
		ОбновитьЗначение(Содержание, "ПредставлениеПрограммы");
		ОбновитьЗначение(Содержание, "КонтейнерКлючаИмя");
		ОбновитьЗначение(Содержание, "КонтейнерКлючаПуть");
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Подготовлено Тогда
		Если ЭтоНовоеСостояние Тогда
			ОбновитьЗначение(Содержание, "Программа", Объект.Программа);
			ОбновитьЗначение(Содержание, "ПредставлениеПрограммы");
			ОбновитьЗначение(Содержание, "КонтейнерКлючаИмя");
			ОбновитьЗначение(Содержание, "КонтейнерКлючаПуть");
			ОбновитьЗначение(Содержание, "ЗапросНаСертификат", ПолучитьИзВременногоХранилища(АдресЗапросаНаСертификат));
			ОбновитьЗначение(Содержание, "ОткрытаяЧастьКлючаЭП");
			ОбновитьЗначение(Содержание, "ИдентификаторКлючаСубъекта");
			ОбновитьЗначение(Содержание, "ДокументыПоляСертификата");
			ОбновитьЗначение(Содержание, "ДатаЗаявления");
		КонецЕсли;
		// Сохранение заполненных значений, если есть.
		ОбновитьЗначение(Содержание, "ДокументыРуководитель");
		ОбновитьЗначение(Содержание, "ДокументыРуководительСсылка");
		ОбновитьЗначение(Содержание, "ДокументыРуководительДолжность");
		ОбновитьЗначение(Содержание, "ДокументыРуководительОснование");
		ОбновитьЗначение(Содержание, "ДокументыПартнер");
		ОбновитьЗначение(Содержание, "ДокументыПартнерСсылка");
		ОбновитьЗначение(Содержание, "ДокументыПартнерЭтоИП");
		ОбновитьЗначение(Содержание, "ДокументыПартнерИНН");
		ОбновитьЗначение(Содержание, "ДокументыПартнерКПП");
		ОбновитьЗначение(Содержание, "ДокументыПечатались");
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Отправлено Тогда
		Если ЭтоНовоеСостояние Тогда
			ОбновитьЗначение(Содержание, "ИдентификаторДокументооборота");
			ОбновитьЗначение(Содержание, "ДатаОтправки");
			ОбновитьЗначение(Содержание, "ДокументыРуководитель");
			ОбновитьЗначение(Содержание, "ДокументыРуководительСсылка");
			ОбновитьЗначение(Содержание, "ДокументыРуководительДолжность");
			ОбновитьЗначение(Содержание, "ДокументыРуководительОснование");
			ОбновитьЗначение(Содержание, "ДокументыПартнер");
			ОбновитьЗначение(Содержание, "ДокументыПартнерСсылка");
			ОбновитьЗначение(Содержание, "ДокументыПартнерЭтоИП");
			ОбновитьЗначение(Содержание, "ДокументыПартнерИНН");
			ОбновитьЗначение(Содержание, "ДокументыПартнерКПП");
		КонецЕсли;
		ОбновитьЗначение(Содержание, "ДатаОбновленияСостояния");
		ОбновитьЗначение(Содержание, "СостояниеОбработкиЗаявления");
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.ИсполненоСертификатНеУстановлен Тогда
		Если ЭтоНовоеСостояние Тогда
			ОбновитьЗначение(Содержание, "ОтпечатокСертификата");
			ОбновитьЗначение(Содержание, "ОтпечатокКорневогоСертификата");
			ОбновитьЗначение(Содержание, "Сертификат",         ПолучитьИзВременногоХранилища(АдресСертификата));
			ОбновитьЗначение(Содержание, "КорневойСертификат", ПолучитьИзВременногоХранилища(АдресКорневогоСертификата));
			ОбновитьЗначение(Содержание, "ИдентификаторАбонента");
			ОбновитьЗначение(Содержание, "ДатаОбновленияСостояния");
			ОбновитьЗначение(Содержание, "СостояниеОбработкиЗаявления");
		КонецЕсли;
		ОбновитьЗначение(Содержание, "ОшибкаУстановкиСертификата");
		ОбновитьЗначение(Содержание, "ДатаУстановкиСертификата");
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Отклонено Тогда
		Если ЭтоНовоеСостояние Тогда
			ОбновитьЗначение(Содержание, "ДатаОбновленияСостояния");
			ОбновитьЗначение(Содержание, "СостояниеОбработкиЗаявления");
			НовоеНаименование = Фамилия + " " + Имя + " " + Отчество + " (" + НСтр("ru = 'Удалить'") + ")";
			Если ТекущийОбъект.Наименование <> НовоеНаименование Тогда
				ТекущийОбъект.Наименование = НовоеНаименование;
				Содержание.ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект.СостояниеЗаявления = Перечисления.СостоянияЗаявленияНаВыпускСертификата.Исполнено Тогда
		Если ЭтоНовоеСостояние Тогда
			ОбновитьЗначение(Содержание, "ОшибкаУстановкиСертификата");
			ОбновитьЗначение(Содержание, "ДатаУстановкиСертификата");
			ЗаполнитьСвойстваОбъектаПоСертификату(ТекущийОбъект, АдресСертификатаКриптографии);
			Содержание.ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Содержание.ЕстьИзменения Тогда
		Содержание.Удалить("ЕстьИзменения");
		ТекущийОбъект.СодержаниеЗаявления = Новый ХранилищеЗначения(Содержание);
		ЭтоНовый = ТекущийОбъект.ЭтоНовый();
		ТекущийОбъект.Записать();
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
		ОповеститьОбИзмененииЗаявления = Истина;
	КонецЕсли;
	ПоследнееСостояниеЗаявления = Объект.СостояниеЗаявления;
	
	Элементы.ПодтверждениеСоглашения.ТолькоПросмотр = Истина;
	
	Если ЭтоНовый Тогда
		ЗаблокироватьДанныеДляРедактирования(ТекущийОбъект.Ссылка, , УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначение(Содержание, ИмяСвойства, Значение = null);
	
	Если Значение = Null Тогда
		Значение = ЭтотОбъект[ИмяСвойства];
	КонецЕсли;
	
	Если Содержание.Свойство(ИмяСвойства) И Содержание[ИмяСвойства] = Значение Тогда
		Возврат;
	КонецЕсли;
	
	Содержание.ЕстьИзменения = Истина;
	Содержание.Вставить(ИмяСвойства, Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСвойстваОбъектаПоСертификату(Объект, Адрес)
	
	ДанныеСертификата = ПолучитьИзВременногоХранилища(Адрес);
	Сертификат = Новый СертификатКриптографии(ДанныеСертификата);
	
	СтруктураСертификата = ЭлектроннаяПодписьКлиентСервер.ЗаполнитьСтруктуруСертификата(Сертификат);
	СвойстваСубъекта = ЭлектроннаяПодписьКлиентСервер.СвойстваСубъектаСертификата(Сертификат);
	
	Объект.Наименование = ЭлектроннаяПодписьКлиентСервер.ПредставлениеСертификата(Сертификат);
	
	Объект.ДанныеСертификата = Новый ХранилищеЗначения(ДанныеСертификата);
	
	Объект.Подписание = Сертификат.ИспользоватьДляПодписи;
	Объект.Шифрование = Сертификат.ИспользоватьДляШифрования;
	
	Объект.Отпечаток      = СтруктураСертификата.Отпечаток;
	Объект.КомуВыдан      = СтруктураСертификата.КомуВыдан;
	Объект.КемВыдан       = СтруктураСертификата.КемВыдан;
	Объект.ДействителенДо = СтруктураСертификата.ДействителенДо;
	
	Объект.Фамилия   = СвойстваСубъекта.Фамилия;
	Объект.Имя       = СвойстваСубъекта.Имя;
	Объект.Отчество  = СвойстваСубъекта.Отчество;
	Объект.Должность = СвойстваСубъекта.Должность;
	Объект.Фирма     = СвойстваСубъекта.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ТекстОповещения = "")
	
	Если Не ОповеститьОбИзмененииЗаявления Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
	ДополнительныеПараметры = Новый Структура;
	Если ЭтоНовый Тогда
		ДополнительныеПараметры.Вставить("ЭтоНовый");
	КонецЕсли;
	Оповестить("Запись_СертификатыКлючейЭлектроннойПодписиИШифрования", ДополнительныеПараметры, Объект.Ссылка);
	
	Если Не ЗначениеЗаполнено(ТекстОповещения) Тогда
		ТекстОповещения = НСтр("ru = 'Заявление сохранено.'");
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ТекстОповещения);
	
	ОповеститьОбИзмененииЗаявления = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИРазблокироватьОбъект()
	
	ЗаписатьЗаявление();
	РазблокироватьОбъект(Объект.Ссылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазблокироватьОбъект(Ссылка, ИдентификаторФормы)
	
	РазблокироватьДанныеДляРедактирования(Ссылка, ИдентификаторФормы);
	
КонецПроцедуры


// Создание ключа и запроса на сертификат.

&НаКлиенте
Процедура СоздатьКлючИЗапросНаСертификат(ОбработкаПродолжения)
	
	Если Криптография <> Неопределено Тогда
		СоздатьКлючИЗапросНаСертификатПослеСозданияОбъектаКриптографии(Истина, ОбработкаПродолжения);
	Иначе
		СоздатьОбъектКриптографии(Новый ОписаниеОповещения(
			"СоздатьКлючИЗапросНаСертификатПослеСозданияОбъектаКриптографии", ЭтотОбъект, ОбработкаПродолжения),
			НСтр("ru = 'Для создания ключа электронной подписи и запроса на сертификат
			           |требуется установить расширение для веб-клиента 1С:Предприятия.'"),
			НСтр("ru = 'Для создания ключа электронной подписи и запроса на сертификат
			           |требуется установить дополнительную внешнюю компоненту.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлючИЗапросНаСертификатПослеСозданияОбъектаКриптографии(Результат, ОбработкаПродолжения) Экспорт
	
	Если Результат <> Истина Тогда
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	Если КонтейнерКлючейСуществует(КонтейнерКлючаПуть, КонтейнерКлючаИмя) Тогда
		Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Используется ранее созданный контейнер ключа: %1'"), КонтейнерКлючаПуть));
	Иначе
		КонтейнерКлючаНовоеИмя = ИмяНовогоКонтейнераКлюча();
		
		АктивноеОкно().Активизировать();
		
		ИнформацияОбОшибке = Неопределено;
		Путь = КонтейнерКлючаНовоеИмя;
		Попытка
			Путь = Криптография.СоздатьКонтейнер(Путь);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Путь = Неопределено;
		КонецПопытки;
		
		АктивноеОкно().Активизировать();
		
		Если ТипЗнч(Путь) <> Тип("Строка") Или ПустаяСтрока(Путь) Тогда
			Если ИнформацияОбОшибке <> Неопределено Тогда
				Ошибка = Новый Структура;
				Ошибка.Вставить("ПоказатьИнструкцию", Истина);
				Ошибка.Вставить("ОписаниеОшибки", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось выполнить операцию по причине:
					           |%1'"),
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
				
				ЭлектроннаяПодписьСлужебныйКлиент.ПоказатьОшибкуОбращенияКПрограмме(
					НСтр("ru = 'Создание ключа электронной подписи'"),, Ошибка, Новый Структура);
			Иначе
				Строки = СписокПрограмм.НайтиСтроки(Новый Структура("Ссылка", Объект.Программа));
				Если Строки[0].Идентификатор = "CryptoPro" Тогда
					ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ключ электронной подписи не создан.
						           |
						           |Следует учитывать, что для создания ключа с помощью программы %1,
						           |требуются права администратора операционной системы.'"),
						Строки[0].Представление));
				Иначе
					ПоказатьПредупреждение(,
						НСтр("ru = 'Ключ электронной подписи не создан.'"));
				КонецЕсли;
			КонецЕсли;
			ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
			Возврат;
		КонецЕсли;
		
		КонтейнерКлючаИмя  = КонтейнерКлючаНовоеИмя;
		КонтейнерКлючаПуть = Путь;
		ЗаписатьЗаявление();
		Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Создан новый контейнер ключа: %1'"), КонтейнерКлючаПуть));
	КонецЕсли;
	
	ИмяФайлаЗапроса = КаталогВременныхФайловКомпоненты() + КонтейнерКлючаИмя + ".p10";
	Файл = Новый Файл(ИмяФайлаЗапроса);
	ПомещаемыеФайлы = Новый Массив;
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(Файл.ПолноеИмя));
	ПомещенныеФайлы = Новый Массив;
	
	Вызовы = Новый Массив;
	ДобавитьВызов(Вызовы, "ПоместитьФайлы", ПомещаемыеФайлы, ПомещенныеФайлы, Неопределено, Ложь, );
	ДобавитьВызов(Вызовы, "УдалитьФайлы", Файл.ПолноеИмя, , , , );
	Если Не ЗапроситьРазрешениеПользователя(Вызовы) Тогда
		ВыполнитьОбработкуОповещения(ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	ЗапросСоздан = Истина;
	ПоляСертификата = Неопределено;
	ОписаниеЗапроса = ОписаниеЗапросаНаКвалифицированныйСертификат(ПоляСертификата);
	ФлагКвалифицированнойЭП = 67108864;
	
	АктивноеОкно().Активизировать();
	
	ЗаголовокОшибки = НСтр("ru = 'Не удалось выполнить операцию по причине:'");
	Попытка
		ЗапросСоздан = Криптография.СоздатьЗапросНаСертификат(ОписаниеЗапроса,
			КонтейнерКлючаПуть, ИмяФайлаЗапроса, ФлагКвалифицированнойЭП);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗапросСоздан = Неопределено;
	КонецПопытки;
	
	АктивноеОкно().Активизировать();
	
	Если ЗапросСоздан = Истина
	   И ( Не Файл.Существует()
	      Или Файл.Размер() = 0 ) Тогда
		
		ЗапросСоздан = Неопределено;
	КонецЕсли;
	
	ЗаголовокОшибки = НСтр("ru = 'Не удалось получить открытую часть ключа по причине:'");
	Если ЗапросСоздан = Истина Тогда
		Попытка
			ТекущаяОткрытаяЧастьКлючаЭП = ""; // ПолучитьОткрытыйКлюч.
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗапросСоздан = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ЗаголовокОшибки = НСтр("ru = 'Не удалось вычислить идентификатор ключа субъекта по причине:'");
	Если ЗапросСоздан = Истина Тогда
		Попытка
			ТекущийИКС = ""; // ВычислитьИдентификаторКлючаСубъекта.
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗапросСоздан = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Если ЗапросСоздан И ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь, УникальныйИдентификатор) Тогда
		АдресЗапросаНаСертификат   = ПомещенныеФайлы[0].Хранение;
		ОткрытаяЧастьКлючаЭП       = ПредставлениеДвоичныхДанных(ТекущаяОткрытаяЧастьКлючаЭП);
		ИдентификаторКлючаСубъекта = ПредставлениеДвоичныхДанных(ТекущийИКС);
		ДокументыПоляСертификата   = ПоляСертификата;
		ДатаЗаявления = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd.MM.yyyy");
	Иначе
		ЗапросСоздан = Неопределено;
	КонецЕсли;
	
	Если ЗапросСоздан <> Истина Тогда
		Если ИнформацияОбОшибке <> Неопределено Тогда
			Ошибка = Новый Структура;
			Ошибка.Вставить("ПоказатьИнструкцию", Истина);
			Ошибка.Вставить("ОписаниеОшибки", ЗаголовокОшибки
				+ Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ЭлектроннаяПодписьСлужебныйКлиент.ПоказатьОшибкуОбращенияКПрограмме(
				НСтр("ru = 'Создание запроса на сертификат'"),, Ошибка, Новый Структура);
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Запрос на сертификат не создан.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Файл.Существует() Тогда
		УдалитьФайлы(Файл.ПолноеИмя);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОбработкаПродолжения, ЗапросСоздан = Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеДвоичныхДанных(Знач Строка, БайтВСтроке = 20)
	
	ОстатокСтроки = НРег(СтрЗаменить(Строка, " ", ""));
	Представление = "";
	БайтВТекущейСтроке = 0;
	
	Пока ЗначениеЗаполнено(ОстатокСтроки) Цикл
		Представление = Представление + Лев(ОстатокСтроки, 2) + " ";
		ОстатокСтроки = Сред(ОстатокСтроки, 3);
		БайтВТекущейСтроке = БайтВТекущейСтроке + 1;
		Если БайтВТекущейСтроке = БайтВСтроке Тогда
			Представление = СокрЛП(Представление) + Символы.ПС;
			БайтВТекущейСтроке = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(Представление);
	
КонецФункции

&НаКлиенте
Функция ИмяНовогоКонтейнераКлюча()
	
	// Дата используется только для уникальности имени, поэтому требуется часы компьютера.
	Дата = ТекущаяДата(); // Не заменять на текущую дату сеанса.
	
	ДатаСоздания = Формат(Дата, "ДФ=гггг-ММ-дд") + " " + Формат(Дата, "ДФ=ЧЧ") + "-" + Формат(Дата, "ДФ=мм");
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		// С<Фамилия Имя>, Индивидуальный предприниматель".
		Субъект = ПодготовитьСтрокуДляИмениКонтейнера(Фамилия) + " "
			+ ПодготовитьСтрокуДляИмениКонтейнера(Имя) + ", "
			+ НСтр("ru = 'Индивидуальный предприниматель'");
	Иначе
		// С<Фамилия Имя>, <Сокращенное наименование организации>".
		Субъект = ПодготовитьСтрокуДляИмениКонтейнера(Фамилия) + " "
			+ ПодготовитьСтрокуДляИмениКонтейнера(Имя) + ", "
			+ ПодготовитьСтрокуДляИмениКонтейнера(НаименованиеСокращенное);
	КонецЕсли;
	
	НовоеИмя = ДатаСоздания + ", " + Лев(Субъект, 60);
	Если Найти(ИменаКонтейнеровКлючей(), НовоеИмя) > 0 Тогда
		НовоеИмя = ДатаСоздания + "-" + Формат(Дата, "ДФ=сс") + ", " + Лев(Субъект, 57);
	КонецЕсли;
	
	Возврат НовоеИмя;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтрокуДляИмениКонтейнера(Строка, ЗаменаПробела = Неопределено)
	
	ЗаменаСимволов = Новый Соответствие;
	ЗаменаСимволов.Вставить("\", " ");
	ЗаменаСимволов.Вставить("/", " ");
	ЗаменаСимволов.Вставить("*", " ");
	ЗаменаСимволов.Вставить("<", " ");
	ЗаменаСимволов.Вставить(">", " ");
	ЗаменаСимволов.Вставить("|", " ");
	ЗаменаСимволов.Вставить(":", "");
	ЗаменаСимволов.Вставить("""", "");
	ЗаменаСимволов.Вставить("?", "");
	ЗаменаСимволов.Вставить(Символы.ВК, "");
	ЗаменаСимволов.Вставить(Символы.ПС, " ");
	ЗаменаСимволов.Вставить(Символы.Таб, " ");
	ЗаменаСимволов.Вставить(Символы.НПП, " ");
	// Замена символов кавычек.
	ЗаменаСимволов.Вставить(Символ(171), "");
	ЗаменаСимволов.Вставить(Символ(187), "");
	ЗаменаСимволов.Вставить(Символ(8195), "");
	ЗаменаСимволов.Вставить(Символ(8194), "");
	ЗаменаСимволов.Вставить(Символ(8216), "");
	ЗаменаСимволов.Вставить(Символ(8218), "");
	ЗаменаСимволов.Вставить(Символ(8217), "");
	ЗаменаСимволов.Вставить(Символ(8220), "");
	ЗаменаСимволов.Вставить(Символ(8222), "");
	ЗаменаСимволов.Вставить(Символ(8221), "");
	
	СтрокаПодготовленная = "";
	
	КоличествоСимволов = СтрДлина(Строка);
	
	Для НомерСимвола = 1 По КоличествоСимволов Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если ЗаменаСимволов[Символ] <> Неопределено Тогда
			Символ = ЗаменаСимволов[Символ];
		КонецЕсли;
		СтрокаПодготовленная = СтрокаПодготовленная + Символ;
	КонецЦикла;
	
	Если ЗаменаПробела <> Неопределено Тогда
		СтрокаПодготовленная = СтрЗаменить(ЗаменаПробела, " ", ЗаменаПробела);
	КонецЕсли;
	
	Возврат СокрЛП(СтрокаПодготовленная);
	
КонецФункции

&НаКлиенте
Функция КонтейнерКлючейСуществует(ПутьПослеСоздания, ИмяДляСоздания)
	
	Если Не ЗначениеЗаполнено(ПутьПослеСоздания) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИменаКонтейнеровКлючей = ИменаКонтейнеровКлючей();
	Строки = СписокПрограмм.НайтиСтроки(Новый Структура("Ссылка", Объект.Программа));
	
	Если Строки[0].Идентификатор = "CryptoPro" Тогда
		Возврат Найти(ИменаКонтейнеровКлючей, ИмяДляСоздания) > 0;
	КонецЕсли;
	
	Позиция = Найти(ПутьПослеСоздания, ":.");
	Если Позиция = 0 Тогда
		Возврат Найти(ИменаКонтейнеровКлючей, ИмяДляСоздания) > 0;
	КонецЕсли;
	
	ИмяПослеСоздания = Лев(ПутьПослеСоздания, Позиция - 1);
	
	Если Найти(ИменаКонтейнеровКлючей, ИмяПослеСоздания) > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Позиция = Найти(ИмяПослеСоздания, "\Infotecs\Containers\");
	Если Позиция = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// ViPNet 3.2 (основная папка контейнеров не указана).
	ИмяПослеСоздания = Сред(ИмяПослеСоздания, Позиция);
	
	Возврат Найти(ИменаКонтейнеровКлючей, ИмяПослеСоздания) > 0;
	
КонецФункции

&НаКлиенте
Функция ИменаКонтейнеровКлючей()
	
	СписокИмен = Новый СписокЗначений;
	
	ТекущееИмя = "";
	Пока Криптография.ПолучитьСледующийКонтейнерКлючей(ТекущееИмя, Истина) Цикл
		СписокИмен.Добавить(ТекущееИмя);
	КонецЦикла;
	
	Индекс = 0;
	ТекущееИмя = "";
	Пока Криптография.ПолучитьСледующийКонтейнерКлючей(ТекущееИмя, Ложь) Цикл
		СписокИмен[Индекс].Представление = ТекущееИмя;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Имена = "";
	Для каждого ЭлементСписка Из СписокИмен Цикл
		УникальноеИмя = ЭлементСписка.Значение;
		
		Если УникальноеИмя = ЭлементСписка.Представление
		   И Найти(УникальноеИмя, "/") = 0
		   И Найти(УникальноеИмя, "\") = 0
		   И Найти(УникальноеИмя, ":") = 0 Тогда
			
			// ViPNet 3.2 (основная папка контейнеров не указана).
			УникальноеИмя = "\Infotecs\Containers\" + УникальноеИмя;
		КонецЕсли;
		
		Имена = Имена + Символы.ПС + УникальноеИмя;
		Имена = Имена + Символы.ПС + ЭлементСписка.Представление;
		Имена = Имена + Символы.ПС;
	КонецЦикла;
	
	Возврат СокрЛП(Имена);
	
КонецФункции

&НаКлиенте
Функция ОписаниеЗапросаНаКвалифицированныйСертификат(Поля)
	
	СписокПараметров = Новый СписокЗначений;
	Поля = Новый Структура;
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		Адрес = ЮридическийАдресСтруктура; // Адрес регистрации индивидуального предпринимателя.
	Иначе
		Адрес = ФактическийАдресСтруктура;  // Адрес местонахождения юридического лица.
	КонецЕсли;
	
	// Поле CN - общее имя (организация или индивидуального предпринимателя).
	Если ЭтоИндивидуальныйПредприниматель Тогда
		CN = СтрЗаменить(Фамилия, " ", "_") + " " + СтрЗаменить(Имя, " ", "_") + " " + СтрЗаменить(Отчество, " ", "_");
	Иначе
		CN = НаименованиеСокращенное;
	КонецЕсли;
	Поля.Вставить("CN", Лев(CN, 64));
	СписокПараметров.Добавить("2.5.4.3", Поля.CN);
		
	
	// Поле SN - фамилия должностного лица или индивидуального предпринимателя.
	SN = СтрЗаменить(Фамилия, " ", "_");
	Поля.Вставить("SN", Лев(SN, 64));
	СписокПараметров.Добавить("2.5.4.4", Поля.SN);
	
	// Поле G - имя и отчество должностного лица или индивидуального предпринимателя.
	G = СтрЗаменить(Имя, " ", "_") + " " + СтрЗаменить(Отчество, " ", "_");
	Поля.Вставить("G", Лев(G, 64));
	СписокПараметров.Добавить("2.5.4.42", Поля.G);
	
	// Поле C - страна.
	Поля.Вставить("C", "RU");
	СписокПараметров.Добавить("2.5.4.6", Поля.C);
	
	// Следующие поля S, L, Street - адрес местонахождения организации или
	// регистрации индивидуального предпринимателя.
	
	// Поле S (ST) - регион (<код региона> <имя региона>) - наименование субъекта РФ для СКПЭП,
	// например, "77 г. Москва".
	S = Адрес.КодРегиона + " " + ИмяРегионаРФПоРекомендациямДляСКПЭП(Адрес.КодРегиона);
	Поля.Вставить("S", Лев(S, 128));
	СписокПараметров.Добавить("2.5.4.8", Поля.S);
	
	// Поле L - населенный пункт (<район> и/или <город> и/или <населенный пункт>).
	// Например, "Москва г, Зеленоград г, Крюково п", "Москва г, Зеленоград г, Малино п".
	L = НаселенныйПунктПолностью(Адрес);
	Поля.Вставить("L", Лев(L, 128));
	СписокПараметров.Добавить("2.5.4.7", Поля.L);
	
	// Поле Street - улица, дом, офис.
	Улица = "";
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"УправлениеКонтактнойИнформациейКлиентСервер");
	
		Структура = Новый Структура("Улица, УлицаСокращение, Дом, ТипДома, Корпус, ТипКорпуса, Квартира, ТипКвартиры");
		ЗаполнитьЗначенияСвойств(Структура, Адрес);
		МодульУправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеАдреса(Структура, Улица);
	КонецЕсли;
	Поля.Вставить("Street", Лев(Улица, 128));
	СписокПараметров.Добавить("2.5.4.9", Поля.Street);
	
	Если ЭтоИндивидуальныйПредприниматель Тогда
		// Поле OGRNIP - ОГРНИП индивидуального предпринимателя 15 символов.
		Поля.Вставить("OGRNIP", ОГРН);
		СписокПараметров.Добавить("1.2.643.100.5", Поля.OGRNIP);
	Иначе
		// Поле O - организация.
		Поля.Вставить("O", Лев(НаименованиеСокращенное, 64));
		СписокПараметров.Добавить("2.5.4.10", Поля.O);
		
		// Поле OU - обособленное подразделение должностного лица.
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Поля.Вставить("OU", Лев(Подразделение, 64));
			СписокПараметров.Добавить("2.5.4.11", Поля.OU);
		КонецЕсли;
		
		// Поле T - должность должностного лица.
		Поля.Вставить("T", Лев(Должность, 64));
		СписокПараметров.Добавить("2.5.4.12", Поля.T);
		
		// Поле OGRN - ОГРН юридического лица 13 символов.
		Поля.Вставить("OGRN", ОГРН);
		СписокПараметров.Добавить("1.2.643.100.1", Поля.OGRN);
	КонецЕсли;
	
	// Поле SNILS - СНИЛС должностного лица или индивидуального предпринимателя.
	Поля.Вставить("SNILS", СтраховойНомерПФР);
	СписокПараметров.Добавить("1.2.643.100.3", Поля.SNILS);
	
	// Поле INN - ИНН организации или индивидуального предпринимателя.
	Поля.Вставить("INN", Прав("00" + ИНН, 12));
	СписокПараметров.Добавить("1.2.643.3.131.1.1", Поля.INN);
	
	// Поле E - электронная почта должностного лица организации или индивидуального предпринимателя.
	Поля.Вставить("E", Лев(ЭлектроннаяПочта, 128));
	СписокПараметров.Добавить("1.2.840.113549.1.9.1", Поля.E);
	
	// Подготовка строки запроса.
	
	Свойства = "";
	Для Каждого Параметр Из СписокПараметров Цикл 
		Свойства = Свойства + ",<" + Параметр.Значение + "=" + СокрЛП(Параметр.Представление) + ">";
	КонецЦикла;
	Свойства = Сред(Свойства, 2);
	
	// Использование ключа - Проверка подлинности клиента, Защищенная электронная почта.
	ИспользованиеКлюча = "1.3.6.1.5.5.7.3.2,1.3.6.1.5.5.7.3.4"; 
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"pRequestInfo:{
		|CertAttrs:{%1}
		|CertEnhKeyUsage:{%2}
		|CertPolicies:{<1.2.643.100.113.1=>}
		|dwKeyUsage:{240}
		|SignTool:{%3}
		|}",
		Свойства,
		ИспользованиеКлюча,
		ПредставлениеПрограммы);
	
КонецФункции


// Создание объекта криптографии.

&НаКлиенте
Процедура СоздатьОбъектКриптографии(ОбработкаПродолжения, НазначениеРасширенияДляРаботыСФайлами, НазначениеВнешнейКомпонентыКриптографии)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбработкаПродолжения", ОбработкаПродолжения);
	ДополнительныеПараметры.Вставить("НазначениеВнешнейКомпонентыКриптографии", НазначениеВнешнейКомпонентыКриптографии);
	
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(
		Новый ОписаниеОповещения("СоздатьОбъектКриптографииПослеПодключенияРасширенияРаботыСФайлами",
			ЭтотОбъект, ДополнительныеПараметры),
		НазначениеРасширенияДляРаботыСФайлами,
		Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектКриптографииПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Путь",
		"Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.Макет.КомпонентаОбмена");
	
	Если ПодключитьВнешнююКомпоненту(ДополнительныеПараметры.Путь, "ЭДОNative") Тогда
		СоздатьОбъектКриптографииПродолжение(ДополнительныеПараметры);
	Иначе
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Установить",      НСтр("ru = 'Установить'"));
		Кнопки.Добавить("НеУстанавливать", НСтр("ru = 'Не устанавливать'"));
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьОбъектКриптографииПослеОтветаНаВопрос", ЭтотОбъект, ДополнительныеПараметры),
			ДополнительныеПараметры.НазначениеВнешнейКомпонентыКриптографии, Кнопки, , "Установить");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектКриптографииПослеОтветаНаВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> "Установить" Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаПродолжения, Ложь);
		Возврат;
	КонецЕсли;
	
	Попытка
		НачатьУстановкуВнешнейКомпоненты(Новый ОписаниеОповещения("СоздатьОбъектКриптографииПродолжение",
			ЭтотОбъект, ДополнительныеПараметры), ДополнительныеПараметры.Путь);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПоказатьПредупреждение(
			Новый ОписаниеОповещения("СоздатьОбъектКриптографииПослеПредупрежденияОбОшибке",
				ЭтотОбъект, ДополнительныеПараметры),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось подключить дополнительную внешнюю компоненту по причине:
				           |%1'"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектКриптографииПродолжение(ДополнительныеПараметры) Экспорт
	
	Если Не ПодключитьВнешнююКомпоненту(ДополнительныеПараметры.Путь, "ЭДОNative") Тогда
		ПоказатьПредупреждение(
			Новый ОписаниеОповещения("СоздатьОбъектКриптографииПослеПредупрежденияОбОшибке",
				ЭтотОбъект, ДополнительныеПараметры),
			НСтр("ru = 'Не удалось подключить дополнительную внешнюю компоненту.'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		Криптография = Новый("Addin.ЭДОNative.CryptS");
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Криптография = Неопределено;
		ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать объект внешней компоненты для работы с криптографией по причине:
			           |%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаПродолжения, Ложь);
		Возврат;
	КонецПопытки;
	
	Если РаботаСДвоичнымиДанными = Неопределено Тогда
		Попытка
			РаботаСДвоичнымиДанными = Новый("Addin.ЭДОNative.BinaryDataS");
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Криптография = Неопределено;
			ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось создать объект внешней компоненты для работы с двоичными данными по причине:
				           |%1'"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаПродолжения, Ложь);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Криптография.НеВыводитьСообщенияОбОшибках = Истина;
	
	Строки = СписокПрограмм.НайтиСтроки(Новый Структура("Ссылка", Объект.Программа));
	ИмяПрограммы = Строки[0].ИмяПрограммы;
	ТипПрограммы = Строки[0].ТипПрограммы;
	ПутьКПрограмме = Строка(ЭлектроннаяПодписьКлиентСервер.ПерсональныеНастройки(
		).ПутиКПрограммамЭлектроннойПодписиИШифрования.Получить(Объект.Программа));
	
	Попытка
		Криптография.СоздатьМенеджераКриптографии(ИмяПрограммы, ПутьКПрограмме, ТипПрограммы);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Криптография = Неопределено;
		ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Программа электронной подписи не доступна через внешнюю компоненту по причине:
			           |%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
	КонецПопытки;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаПродолжения, Криптография <> Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектКриптографииПослеПредупрежденияОбОшибке(ДополнительныеПараметры) Экспорт
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаПродолжения, Ложь);
	
КонецПроцедуры

// Создание каталога временных файлов компоненты ExtIntgr.

&НаКлиенте
Функция КаталогВременныхФайловКомпоненты()
	
	Возврат ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		РаботаСДвоичнымиДанными.ПолучитьКаталогВременныхФайлов());
	
КонецФункции

#КонецОбласти
