
Функция ПолучитьПродажи(СписокЧеков)Экспорт

	//ЧекиДляВыгрузки = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	
	Попытка
		
		Для Каждого элСтрока Из СписокЧеков.Value Цикл
			
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ОбъектХДТО = Сериализатор.ПрочитатьXDTO(элСтрока);

			//Продажи.Подразделение = Справочники.Подразделения.НайтиПоКоду(ОбъектХДТО.КодПодразделения,Истина);
			НайденнаяСсылка =  Справочники.Подразделения.НайтиПоРеквизиту("КодПодразделенияУТ",ОбъектХДТО.КодПодразделения);
			Если НЕ НайденнаяСсылка=Справочники.Подразделения.ПустаяСсылка() Тогда 
				Продажи	 = РегистрыСведений.МониторПродаж.СоздатьМенеджерЗаписи();
				Продажи.Период = ОбъектХДТО.Период; //дата-время чека
				Продажи.Подразделение = НайденнаяСсылка;
				Продажи.НомерКассы = ОбъектХДТО.НомерКассы;
				Продажи.Группа = ОбъектХДТО.Группа;
				
				
				Продажи.Сумма = ОбъектХДТО.Сумма ;
				Продажи.КолвоШт = ОбъектХДТО.КолвоШт;
				Продажи.КолвоЧеков = ОбъектХДТО.КолвоЧеков;
				
				Продажи.Время = ТекущаяДата();
				Продажи.Записать();
				
				//Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
				//ОбъектХДТО = Сериализатор .ЗаписатьXDTO(ОбъектХДТО.КодПодразделения);
				//
				//ЧекиДляВыгрузки.value.Добавить(ОбъектХДТО);
			КонеЦесли;
		КонецЦикла;
		Возврат  Истина;
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Описание = Инфо.Описание;
	Возврат  Ложь;
	КонецПопытки;
	
		
КонецФункции

Функция ПолучитьПлан(СписокЧеков)Экспорт

	//ЧекиДляВыгрузки = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core", "Array"));
	
	Попытка
		
		Для Каждого элСтрока Из СписокЧеков.Value Цикл
			Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
			ОбъектХДТО = Сериализатор.ПрочитатьXDTO(элСтрока);
			
			
			НайденнаяСсылка =  Справочники.Подразделения.НайтиПоРеквизиту("КодПодразделенияУТ",ОбъектХДТО.КодПодразделения);
			Если НЕ НайденнаяСсылка=Справочники.Подразделения.ПустаяСсылка() Тогда
				ПланПродаж	 = РегистрыСведений.ПланПродаж.СоздатьМенеджерЗаписи();
				ПланПродаж.Период = ОбъектХДТО.Период;
				ПланПродаж.Подразделение = НайденнаяСсылка;
				ПланПродаж.Сумма = ОбъектХДТО.Сумма ;
				ПланПродаж.Записать();
				//Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
				//ОбъектХДТО = Сериализатор .ЗаписатьXDTO(ОбъектХДТО.КодПодразделения);
				//ЧекиДляВыгрузки.value.Добавить(ОбъектХДТО);
			КонецЕсли;
		КонецЦикла;
		Возврат  Истина;
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Описание = Инфо.Описание;
		Возврат  Ложь;

	КонецПопытки;
		
КонецФункции
