
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийПользователь = ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриОткрытииНаСервере()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
КонецФункции

&НаСервереБезКонтекста
Процедура СменитьПарольНаСервере(ТекПользователь,НовыйПароль)
	Юзер = ПользователиИнформационнойБазы.НайтиПоИмени(ТекПользователь);
	Юзер.Пароль = НовыйПароль;
	Попытка
		Юзер.Записать();
		ОбъектПользователь = Справочники.Пользователи.НайтиПоНаименованию(ТекПользователь).ПолучитьОбъект();
		ОбъектПользователь.ПервыйЗапуск = Ложь;
		ОбъектПользователь.Записать();
	Исключение
		Сообщить("Пароль не сменен");
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СменитьПароль(Команда)
	Если НовыйПарольЕще <> НовыйПароль ИЛИ НовыйПарольЕще ="" Тогда
		Сообщ = Новый СообщениеПользователю;
		Сообщ.Текст = "Пароли должны совпадать в полях ""Новый пароль"" и ""Новый пароль еще раз"". Пустые пароли недопустимы!!!";
		Сообщ.Поле = "НовыйПарольЕще";
		Сообщ.Сообщить();
		Возврат;
	КонецЕсли;
	СменитьПарольНаСервере(ТекущийПользователь,НовыйПароль);
	ЭтаФорма.Закрыть();
КонецПроцедуры
