
Процедура ПередЗаписью(Отказ)
	
	Если Ссылка.ПометкаУдаления = Ложь  И ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Ссылка,
			|	РезультатыПроверкиМагазинаРДСокращенныеРезультаты.ЗадачаУправляющему
			|ИЗ
			|	Документ.РезультатыПроверкиМагазинаРДСокращенные.Результаты КАК РезультатыПроверкиМагазинаРДСокращенныеРезультаты
			|ГДЕ
			|	РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий = &Критерий
			|	И РезультатыПроверкиМагазинаРДСокращенныеРезультаты.ЗадачаУправляющему <> ЗНАЧЕНИЕ(Задача.ЗадачаИсполнителя.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Критерий", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить(ВыборкаДетальныеЗаписи.ЗадачаУправляющему);
			ВыборкаДетальныеЗаписи.ЗадачаУправляющему.ПолучитьОбъект().Удалить();
		КонецЦикла;
	КонецЕсли;
	
	Наименование = ПолнНаименование + ?(ЗначениеЗаполнено(Описание), " / " + Описание, "");
КонецПроцедуры
