
Процедура ПриЗаписи(Отказ)
	Если РегиональныйДиректор Тогда			
		ВыставитьРоль(Метаданные.Роли.РД);
	Иначе
		ВыставитьРоль(Метаданные.Роли.РД,Истина);
	КонецЕсли;
	
	Если ДепартаментПерсонала = Истина Тогда			
		ВыставитьРоль(Метаданные.Роли.HR);
	Иначе
		ВыставитьРоль(Метаданные.Роли.HR,Истина);
	КонецЕсли;
	
	Если ДепартаментАудитаИКонтроля = Истина Тогда			
		ВыставитьРоль(Метаданные.Роли.ДАиК);
	Иначе
		ВыставитьРоль(Метаданные.Роли.ДАиК,Истина);
	КонецЕсли;

	
	Если Директор = Истина Тогда			
		ВыставитьРоль(Метаданные.Роли.Директора);
	Иначе
		ВыставитьРоль(Метаданные.Роли.Директора,Истина);
	КонецЕсли;
	
	Если УправляющиеМагазинами = Истина Тогда			
		ВыставитьРоль(Метаданные.Роли.УправляющиеМагазинами);
	Иначе
		ВыставитьРоль(Метаданные.Роли.УправляющиеМагазинами,Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ВыставитьРоль(Роль,Удалить = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ИдентификаторПользователяИБ,
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.СоотвСотрудник.Должность.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ВыборкаДетальныеЗаписи.ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			Если Удалить Тогда
				ПользовательИБ.Роли.Удалить(Роль);
			Иначе
				ПользовательИБ.Роли.Добавить(Роль);
			КонецЕсли;
			ПользовательИБ.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

