Функция МагазинКратко(СсылкаПодразделение) Экспорт
	Наим = СсылкаПодразделение.Наименование;
	НомПоз = Найти(Наим,")");
	Возврат Лев(Наим,НомПоз);	
КонецФункции


Функция ПроцентВыполнения(СуммаКво,СуммаМаксКво) Экспорт	
	Если СуммаКво = 0 ИЛИ СуммаКво = NULL ИЛИ СуммаМаксКво = NULL Тогда
		Возврат "0 %";
	Иначе
		рет = ФОРМАТ(СуммаКво/СуммаМаксКво*100,"ЧДЦ=2");
		Возврат рет + " %";
	КонецЕсли;
КонецФункции

Функция ПроцентВыполненияЧисло(СуммаКво,СуммаМаксКво,Количество) Экспорт	
	Если Количество = 1 Тогда
		Если СуммаКво = 0 ИЛИ СуммаКво = NULL ИЛИ СуммаМаксКво = NULL Тогда
			Возврат "0";
		Иначе
			Возврат "1";
		КонецЕсли;
	Иначе
		Если СуммаКво = 0 ИЛИ СуммаКво = NULL ИЛИ СуммаМаксКво = NULL Тогда
			Возврат "0 %";
		Иначе
			рет = ФОРМАТ(СуммаКво/СуммаМаксКво*100,"ЧДЦ=2");
			Возврат рет + " %";
		КонецЕсли; 
	КонецЕсли;
КонецФункции
