
Процедура ПередЗаписью(Отказ)
	
	//Если Ссылка.ПометкаУдаления = Ложь  И ПометкаУдаления Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	РезультатыПроверкиМагазинаРДРезультаты.Ссылка,
	//		|	РезультатыПроверкиМагазинаРДРезультаты.ЗадачаУправляющему
	//		|ИЗ
	//		|	Документ.РезультатыПроверкиМагазинаРД.Результаты КАК РезультатыПроверкиМагазинаРДРезультаты
	//		|ГДЕ
	//		|	РезультатыПроверкиМагазинаРДРезультаты.Критерий = &Критерий
	//		|	И РезультатыПроверкиМагазинаРДРезультаты.ЗадачаУправляющему <> ЗНАЧЕНИЕ(Задача.ЗадачаИсполнителя.ПустаяСсылка)";
	//	
	//	Запрос.УстановитьПараметр("Критерий", Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Сообщить(ВыборкаДетальныеЗаписи.ЗадачаУправляющему);
	//		ВыборкаДетальныеЗаписи.ЗадачаУправляющему.ПолучитьОбъект().Удалить();
	//	КонецЦикла;
	//КонецЕсли;
	//
	//Наименование = ПолнНаименование;
КонецПроцедуры
