
&НаСервере
Процедура МоиНаСервере()
	Если РольДоступна("ПолныеПрава") = Ложь Тогда
		ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Автор");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ПользователиКлиентСервер.ТекущийПользователь();
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Управляющий");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ПользователиКлиентСервер.ТекущийПользователь().СоотвСотрудник;
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Мои(Команда)
	Элементы.Мои.ЦветТекста=Новый Цвет(255, 0, 0);
	Элементы.Все.ЦветТекста=Новый Цвет(77, 77, 77);
	МоиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВсеНаСервере()
	Список.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Все(Команда)
	Элементы.Все.ЦветТекста=Новый Цвет(255, 0, 0);
	Элементы.Мои.ЦветТекста=Новый Цвет(77, 77, 77);
	ВсеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Мои.ЦветТекста=Новый Цвет(255, 0, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если (НЕ РольДоступна("ДАиК")) И (НЕ РольДоступна("УправляющиеМагазинами")) Тогда
	    Элементы.Мои.Видимость=Ложь;
		ВсеНаСервере();
	Иначе
		МоиНаСервере();
	КонецЕсли;
КонецПроцедуры
