
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	Если ВариантОтчета Тогда
		ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек[1];
	Иначе
		ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек[0];
	КонецЕсли;
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, ВариантНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки,ИСТИНА);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры
