
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки,ИСТИНА);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ОбработатьЗаголовки(ДокументРезультат);
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);

КонецПроцедуры

// Проверка двух смежных ячеек на идентичночность
Функция ОбъединятьЯчейки(ТабДок, индСтр, индКол)

	Ячейка = ТабДок.Область(индСтр, индКол);
	ЯчейкаСлед = ТабДок.Область(индСтр, индКол+1);
	Если ПустаяСтрока(Ячейка.Текст) ИЛИ ПустаяСтрока(ЯчейкаСлед.Текст) Тогда
		Возврат ложь;
	Иначе
		Если индКол <> 1 Тогда
			Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
			Ячейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			Ячейка.ЦветФона = Новый Цвет(255,255,153);
			Ячейка.ЦветТекста = Новый Цвет(0,0,0);
			Ячейка.ГраницаСлева = Линия;
			Ячейка.ГраницаСправа = Линия;
			
			ЯчейкаДата = ТабДок.Область(индСтр+1,индКол);
			ЯчейкаДата.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ЯчейкаДата.ЦветФона = Новый Цвет(204,255,204);
			ЯчейкаДата.ЦветТекста = Новый Цвет(0,0,0);
			ЯчейкаДата.ГраницаСлева = Линия;
			ЯчейкаДата.ГраницаСправа = Линия;
		КонецЕсли;
		Если  Ячейка.Текст = ЯчейкаСлед.Текст и Ячейка.Имя = "R"+индСтр+"C"+индКол Тогда   //Проверяем на соответствие заголовка
															// Проверяем на соответствие имени (отсеиваем уже объединенные ячейки) 
	 		Возврат Истина;
	 	Иначе
	 		Возврат ложь;
		КонецЕсли;
	КонецЕсли;

КонецФункции

// Обработка заголовков таблицы
//
// Параметры
// Табл - < Тип.ТабличныйДокумент> - Табличный документ формы
Процедура ОбработатьЗаголовки(ТабДок)

	 ОбъединяемаяОбласть = Неопределено;

	 //Для оптимизации здесь нужно будет ограничить высоту таблицы
	 Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл

	 	НачальнаяКолонка = 0;
	 	Для индКол=1 По ТабДок.ШиринаТаблицы Цикл

	 // определяем начало объединения
			Если ОбъединятьЯчейки(ТабДок, индСтр, индКол) Тогда

		 		Если не НачальнаяКолонка Тогда

		 			НачальнаяКолонка = индКол;

		 		КонецЕсли;

		 	ИначеЕсли НачальнаяКолонка Тогда
		 // завершаем объединение

				 ТекстЗаголовка = ТабДок.Область(индСтр, индКол).Текст;
				 ОбъединяемаяОбласть = ТабДок.Область(индСтр, НачальнаяКолонка, индСтр, индКол);
				 ОбъединяемаяОбласть.Объединить();
				 ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
				 
				 НачальнаяКолонка = 0;
			 Иначе

			 	 НачальнаяКолонка = 0;

			 КонецЕсли;

		 КонецЦикла;

		 // Если нашли в строке области для объединения то прекращаем дальнейшие поиски
		 Если не ОбъединяемаяОбласть = Неопределено Тогда

		 	возврат;

		 КонецЕсли;

	 КонецЦикла;

КонецПроцедуры