&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт

    РегистрационныеДанные = Новый Структура();
    РегистрационныеДанные.Вставить("Наименование", "Отчет Конверсия покупателей");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Версия", "v 1.0");
    РегистрационныеДанные.Вставить("Информация", "v 1.0");
    РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");

    тз = Новый ТаблицаЗначений;
    тз.Колонки.Добавить("Идентификатор");
    тз.Колонки.Добавить("Использование");
    тз.Колонки.Добавить("Представление");
    тз.Колонки.Добавить("Модификатор");
    тз.Колонки.Добавить("ПоказыватьОповещение");

    НоваяСтрока = тз.Добавить();
    НоваяСтрока.Идентификатор = "ОткрытьОтчет";
    НоваяСтрока.Использование = "ОткрытиеФормы";
    НоваяСтрока.Представление = "Отчет Конверсия покупателей";

    РегистрационныеДанные.Вставить("Команды", тз);

    Возврат РегистрационныеДанные;

КонецФункции