
Процедура ПередЗаписью(Отказ)
	Если Ссылка.ПометкаУдаления = Ложь  И ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РезультатыПроверкиМагазинаДАиКРезультаты.Ссылка,
			|	РезультатыПроверкиМагазинаДАиКРезультаты.ЗадачаУправляющему
			|ИЗ
			|	Документ.РезультатыПроверкиМагазинаДАиК.Результаты КАК РезультатыПроверкиМагазинаДАиКРезультаты
			|ГДЕ
			|	РезультатыПроверкиМагазинаДАиКРезультаты.Критерий = &Критерий
			|	И РезультатыПроверкиМагазинаДАиКРезультаты.ЗадачаУправляющему <> ЗНАЧЕНИЕ(Задача.ЗадачаИсполнителя.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Критерий", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить(ВыборкаДетальныеЗаписи.ЗадачаУправляющему);
			ВыборкаДетальныеЗаписи.ЗадачаУправляющему.ПолучитьОбъект().Удалить();
		КонецЦикла;
	КонецЕсли;

	
	Наименование = ПолнНаименование;
КонецПроцедуры
