
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.Автор.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Город.ТолькоПросмотр = Ложь;
		Элементы.Управляющий.ТолькоПросмотр = Ложь;
		Элементы.НацДиректор.ТолькоПросмотр = Ложь;
		Элементы.РегионДиректор.ТолькоПросмотр = Ложь;
		Элементы.Результаты.ТолькоПросмотр = Ложь;
		Элементы.Автор.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Автор.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры
