
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	ДокСсылка = Ссылка[0];	
	
	Макет1 = Документы.РезультатыПроверкиМагазинаРДСокращенные.ПолучитьМакет("Печать");
	
	Обл = Макет1.ПолучитьОбласть("Шапка");
	Обл.Параметры.Заполнить(ДокСсылка);
	ТабДок.Вывести(Обл);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.НомерПоПорядку > 1000
	               |			ТОГДА ВложенныйЗапрос.НомерПоПорядку
	               |		ИНАЧЕ ВложенныйЗапрос.РодительНомерПоПорядку * 1000 + ВложенныйЗапрос.НомерПоПорядку
	               |	КОНЕЦ КАК ОбщийНомерПоПорядку,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	СУММА(ВложенныйЗапрос.Кво) КАК Кво,
	               |	МАКСИМУМ(ВложенныйЗапрос.КомментарииПроверяющего) КАК КомментарииПроверяющего,
	               |	МАКСИМУМ(ВложенныйЗапрос.СрокУстранения) КАК СрокУстранения,
	               |	МАКСИМУМ(ВложенныйЗапрос.ОтметкаОбИсполнении) КАК ОтметкаОбИсполнении,
	               |	МАКСИМУМ(ВложенныйЗапрос.КомментарийИсполнителя) КАК КомментарийИсполнителя,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЗадачаУправляющемуСсылка) КАК ЗадачаУправляющемуСсылка,
	               |	ВложенныйЗапрос.Описание,
	               |	ВложенныйЗапрос.Ссылка.ПризнакОтветственныеДепартаменты КАК ПризнакОтветственныеДепартаменты
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КритерииПроверкиМагазиновРД_Сокращенные.Ссылка КАК Ссылка,
	               |		КритерииПроверкиМагазиновРД_Сокращенные.Родитель КАК Родитель,
	               |		КритерииПроверкиМагазиновРД_Сокращенные.ЭтоГруппа КАК ЭтоГруппа,
	               |		КритерииПроверкиМагазиновРД_Сокращенные.ПолнНаименование КАК ПолнНаименование,
	               |		КритерииПроверкиМагазиновРД_Сокращенные.Описание КАК Описание,
	               |		ВЫБОР
	               |			КОГДА НЕ КритерииПроверкиМагазиновРД_Сокращенные.ЭтоГруппа
	               |				ТОГДА КритерииПроверкиМагазиновРД_Сокращенные.НомерПоПорядку
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА КритерииПроверкиМагазиновРД_Сокращенные.Родитель.Ссылка ЕСТЬ NULL 
	               |						ТОГДА 1000 * КритерииПроверкиМагазиновРД_Сокращенные.НомерПоПорядку
	               |					ИНАЧЕ 1000 * КритерииПроверкиМагазиновРД_Сокращенные.Родитель.НомерПоПорядку + КритерииПроверкиМагазиновРД_Сокращенные.НомерПоПорядку
	               |				КОНЕЦ
	               |		КОНЕЦ КАК НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииПроверкиМагазиновРД_Сокращенные.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииПроверкиМагазиновРД_Сокращенные.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительНомерПоПорядку,
	               |		0 КАК Кво,
	               |		"""" КАК КомментарииПроверяющего,
	               |		&ПустДата КАК СрокУстранения,
	               |		ЛОЖЬ КАК ОтметкаОбИсполнении,
	               |		"""" КАК КомментарийИсполнителя,
	               |		0 КАК ЗадачаУправляющемуСсылка
	               |	ИЗ
	               |		Справочник.КритерииПроверкиМагазиновРД_Сокращенные КАК КритерииПроверкиМагазиновРД_Сокращенные
	               |	ГДЕ
	               |		НЕ КритерииПроверкиМагазиновРД_Сокращенные.ПометкаУдаления
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.Родитель,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.ЭтоГруппа,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.ПолнНаименование,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.Описание,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Критерий.Родитель.НомерПоПорядку
	               |		КОНЕЦ,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Кво,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.КомментарииПроверяющего,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.СрокУстранения,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.ОтметкаОбИсполнении,
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.КомментарийИсполнителя,
	               |		ВЫБОР
	               |			КОГДА РезультатыПроверкиМагазинаРДСокращенныеРезультаты.ЗадачаУправляющему ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ РезультатыПроверкиМагазинаРДСокращенныеРезультаты.ЗадачаУправляющему
	               |		КОНЕЦ
	               |	ИЗ
	               |		Документ.РезультатыПроверкиМагазинаРДСокращенные.Результаты КАК РезультатыПроверкиМагазинаРДСокращенныеРезультаты
	               |	ГДЕ
	               |		РезультатыПроверкиМагазинаРДСокращенныеРезультаты.Ссылка = &ВыбДокумент) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.Описание
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбщийНомерПоПорядку";

				   
				   
	Запрос.УстановитьПараметр("ВыбДокумент", Ссылка[0]);
	Запрос.УстановитьПараметр("ПустДата", Дата(2010,1,1));

	
	тз = Запрос.Выполнить().Выгрузить();
	//тз.Сортировать("РодительРодительНомерПоПорядку, РодительНомерПоПорядку, НомерПоПорядку");
	

	Нпп = 0;
	Для Каждого стр из тз цикл
		Если стр.ЭтоГруппа тогда
			//Если ЗначениеЗаполнено(стр.Родитель) тогда  // подгруппа
				
				ПараметрыОтбора = Новый Структура("Родитель",стр.Ссылка);
				МассивСтрок = тз.НайтиСтроки(ПараметрыОтбора);
				СуммаГруппы = 0;
				Для Каждого эл Из МассивСтрок Цикл
					СуммаГруппы = СуммаГруппы + эл.Кво;
				КонецЦикла;
				
				Обл = Макет1.ПолучитьОбласть("Группа");
				Обл.Параметры.СтрГруппа = стр.ПолнНаименование;
				Обл.Параметры.Родитель = стр.Родитель;
				Обл.Параметры.БалГруппа = СуммаГруппы;
				ТабДок.Вывести(Обл);

	//		иначе  // раздел		
	//			
	//			ПараметрыОтбора = Новый Структура("ГлРодитель",стр.Ссылка);
	//			МассивСтрок = тз.НайтиСтроки(ПараметрыОтбора);
	//			СуммаРаздела = 0;
	//			Для Каждого эл Из МассивСтрок Цикл
	//				СуммаРаздела = СуммаРаздела + эл.Кво;
	//			КонецЦикла;
	//
	//			Обл = Макет1.ПолучитьОбласть("Раздел");
	//			Обл.Параметры.СтрРаздел = стр.ПолнНаименование;
	//			Обл.Параметры.Родитель = "Сам";
	//			Обл.Параметры.БалРаздел = СуммаРаздела;
	//			ТабДок.Вывести(Обл);

	//		КонецЕсли;
			
		иначе // строка
			
			Нпп = Нпп + 1;
			Обл = Макет1.ПолучитьОбласть("Строка");
			Обл.Параметры.Нпп = Нпп;
			Обл.Параметры.СтрНаим = стр.ПолнНаименование;
			Обл.Параметры.ТекКритерий = стр.Ссылка;
			Обл.Параметры.СтрБал = стр.Кво;		 
			Обл.Параметры.СтрКоммент = стр.КомментарииПроверяющего;	
			Обл.Параметры.Родитель = стр.Родитель;

			Если стр.СрокУстранения <> Дата(2010,1,1) тогда
				Обл.Параметры.СтрДат = стр.СрокУстранения;
			КонецЕсли;
			ТабДок.Вывести(Обл);
			ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C3").Формат = "ЧН=0";
		КонецЕсли;
	КонецЦикла;
	ТабДок.ФиксацияСверху = 8;
	ОблПусто = Макет1.ПолучитьОбласть("Пусто");
	ТабДок.Вывести(ОблПусто);
	КолвоКритериев = Нпп;	
КонецПроцедуры
