
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Автор = ПользователиКлиентСервер.ТекущийПользователь();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Пользователи.Ссылка КАК Пользователь
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.СоотвСотрудник = &СоотвСотрудник";
				   
	Запрос.УстановитьПараметр("СоотвСотрудник", Управляющий);
	
	ПользУправляющий = Справочники.Пользователи.ПустаяСсылка();
	выб = Запрос.Выполнить().Выбрать();
	Если выб.Следующий() тогда
		ПользУправляющий = выб.Пользователь;
	КонецЕсли;

	//если нужно - создаем задачи
	Для Каждого стр из Результаты цикл
		Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) И (стр.ЗадачаУправляющему<> Задачи.ЗадачаИсполнителя.ПустаяСсылка()) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗадачаИсполнителя.Ссылка
				|ИЗ
				|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
				|ГДЕ
				|	ЗадачаИсполнителя.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", стр.ЗадачаУправляющему);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗадачаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ЗадачаОбъект.ОбменДанными.Загрузка = истина;
			    ЗадачаОбъект.Удалить();
			 КонецЦикла;
			 
			стр.ЗадачаУправляющему = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
		КонецЕсли;

		Если (ЗначениеЗаполнено(стр.КомментарииПроверяющего)) И (РежимЗаписи = РежимЗаписиДокумента.Проведение) И (стр.Кво=0) тогда
			// проверка пользователя для сотрудника = управляющего
						
			Если ПользУправляющий = Справочники.Пользователи.ПустаяСсылка() тогда
				Сообщить("Для сотрудника " + Управляющий + " не задано соответствие в пользователях." + 
				Символы.ПС + "Невозможно установить задачу!");
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стр.ЗадачаУправляющему) тогда
				ТекЗадача = стр.ЗадачаУправляющему.ПолучитьОбъект();
			иначе
				ТекЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
				ТекЗадача.РезультатВыполнения = Перечисления.СтатусыВыполнения.НеВыполнено;
				ТекЗадача.РезультатВыполненияСтрокой = Строка(ТекЗадача.РезультатВыполнения);
			КонецЕсли;
			
			ТекЗадача.Автор = Автор;
			ТекЗадача.Дата = Дата;//ТекущаяДатаСеанса();
			ТекЗадача.Город = Город;
			ТекЗадача.Подразделение = Подразделение;
			ТекЗадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
			ТекЗадача.Исполнитель = ПользУправляющий;//ТекущийОбъект.Управляющий;
			//ТекЗадача.Предмет = ЗадачаСсылка;
			ТекЗадача.ДокОснование = Ссылка;
			ТекЗадача.СрокИсполнения = стр.СрокУстранения;
			
			ТекЗадача.Описание = стр.КомментарииПроверяющего;
			ТекЗадача.Наименование = "Указание по результату проверки РД №" + Номер + " от " + Дата;
			
			ТекЗадача.Записать();
			 			
			
			стр.ЗадачаУправляющему = ТекЗадача.Ссылка;

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
