
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Город.ТолькоПросмотр = Ложь;
		Элементы.Управляющий.ТолькоПросмотр = Ложь;
		Элементы.НацДиректор.ТолькоПросмотр = Ложь;
		Элементы.РегионДиректор.ТолькоПросмотр = Ложь;
		Элементы.Результаты.ТолькоПросмотр = Ложь;
		Элементы.Автор.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Автор.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	ТекущийОбъект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
//	
//	//если нужно - создаем задачи
//	Для Каждого стр из ТекущийОбъект.Результаты цикл
//		Если ЗначениеЗаполнено(стр.КомментарииПроверяющего) тогда
//			// проверка пользователя для сотрудника = управляющего
//			Запрос = Новый Запрос;
//			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//			               |	Пользователи.Ссылка КАК Пользователь
//			               |ИЗ
//			               |	Справочник.Пользователи КАК Пользователи
//			               |ГДЕ
//			               |	Пользователи.СоотвСотрудник = &СоотвСотрудник";
//						   
//			Запрос.УстановитьПараметр("СоотвСотрудник", ТекущийОбъект.Управляющий);
//			
//			ПользУправляющий = Справочники.Пользователи.ПустаяСсылка();
//			выб = Запрос.Выполнить().Выбрать();
//			Если выб.Следующий() тогда
//				ПользУправляющий = выб.Пользователь;
//			КонецЕсли;
//			
//			Если ПользУправляющий = Справочники.Пользователи.ПустаяСсылка() тогда
//				Сообщить("Для сотрудника " + ТекущийОбъект.Управляющий + " не задано соответствие в пользователях." + 
//				Символы.ПС + "Невозможно установить задачу!");
//				Продолжить;
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(стр.ЗадачаУправляющему) тогда
//				ТекЗадача = стр.ЗадачаУправляющему.ПолучитьОбъект();
//			иначе
//				ТекЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
//			КонецЕсли;
//			
//			ТекЗадача.Автор = ТекущийОбъект.Автор;
//			ТекЗадача.Дата = ТекущийОбъект.Дата;//ТекущаяДатаСеанса();
//			ТекЗадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
//			ТекЗадача.Исполнитель = ПользУправляющий;//ТекущийОбъект.Управляющий;
//			//ТекЗадача.Предмет = ЗадачаСсылка;
//			ТекЗадача.СрокИсполнения = стр.СрокУстранения;
//			
//			ТекЗадача.Описание = стр.КомментарииПроверяющего;
//			ТекЗадача.Наименование = "Выполнить указания согласно проверки №" + ТекущийОбъект.Номер + " от " + ТекущийОбъект.Дата;
//			
//			ТекЗадача.Записать();
//			 			
//			
//			стр.ЗадачаУправляющему = ТекЗадача.Ссылка;

//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры
