&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт

    РегистрационныеДанные = Новый Структура();
    РегистрационныеДанные.Вставить("Наименование", "Отчет Монитор продаж");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Версия", "v 1.0");
    РегистрационныеДанные.Вставить("Информация", "v 1.0");
    РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");

    тз = Новый ТаблицаЗначений;
    тз.Колонки.Добавить("Идентификатор");
    тз.Колонки.Добавить("Использование");
    тз.Колонки.Добавить("Представление");
    тз.Колонки.Добавить("Модификатор");
    тз.Колонки.Добавить("ПоказыватьОповещение");

    НоваяСтрока = тз.Добавить();
    НоваяСтрока.Идентификатор = "ОткрытьОтчет";
    НоваяСтрока.Использование = "ОткрытиеФормы";
    НоваяСтрока.Представление = "Отчет Монитор продаж";

    РегистрационныеДанные.Вставить("Команды", тз);

    Возврат РегистрационныеДанные;

КонецФункции

&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	ТекущийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	
	Если РольДоступна("ПросмотрОтчетовБезОтборов") Тогда
		
	Иначе
		
		СписокРазрешенных = Новый СписокЗначений;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	(Подразделения.НД = &ПользовательОтч
		|			ИЛИ Подразделения.Управляющий = &ПользовательОтч
		|			ИЛИ Подразделения.РД = &ПользовательОтч)";
		
		Запрос.УстановитьПараметр("ПользовательОтч", ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокРазрешенных.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		Настройки = КомпоновщикНастроек.Настройки;   
		
		НовыйЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Подразделение");
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		
		НовыйЭлементОтбора.ПравоеЗначение = СписокРазрешенных;
		
		
	КонецЕсли;
	
КонецПроцедуры


	
