Процедура ВыполнитьНастройкуПанелей() Экспорт
	
	// Для примера будем менять настройки пользователя "не глядя" на то, что он себе настроил.
	// Создать пустой объект настроек.
	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	
	// С помощью пустого объекта настроек получить настройки состава, установленные в конфигураторе.
	НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	
	// Очистить настройки состава.
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	
	// Заполнить своими панелями.
	// Для примера самый простой вариант: слева - панель инструментов.
	ПанельИнструментов = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов");
	ПанельФункций = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельФункцийТекущегоРаздела");
	НастройкиСостава.Верх.Добавить(ПанельИнструментов);
	НастройкиСостава.Верх.Добавить(ПанельФункций);
	
	// Загрузить настройки состава в пустой объект настроек.
	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	
	// Положить объект настроек текущему пользователю в хранилище.
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
	
КонецПроцедуры
